[
    {
        "author": "Fit_Singer1777",
        "created_utc": "Sunday, June 05, 2022 07:48:56",
        "full_link": "https://www.reddit.com/r/anime/comments/v516xw/this_guy_has_a_pfp_of_an_anime_character_does/",
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/txpb3951zo391.png?width=84&amp;format=png&amp;auto=webp&amp;s=72ae48beedb6ee9400259985efa5017d4509ff17",
        "subreddit": "anime",
        "title": "This guy has a pfp of an anime character, does anyone know where it's from?",
        "created": "Saturday, June 04, 2022 11:48:56",
        "removed_by_category": null,
        "Preprocessed post": "ampx200b isURL"
    },
    {
        "author": "Bunkbedboi",
        "created_utc": "Sunday, June 05, 2022 07:43:21",
        "full_link": "https://www.reddit.com/r/anime/comments/v513md/what_do_you_think/",
        "selftext": "What do y'all think about Harems in anime/manga I personally think it's dumb.",
        "subreddit": "anime",
        "title": "What do you think?",
        "created": "Saturday, June 04, 2022 11:43:21",
        "removed_by_category": null,
        "Preprocessed post": "what do yall think about harems in animemanga i personally think its dumb"
    },
    {
        "author": "fapping_giraffe",
        "created_utc": "Sunday, June 05, 2022 07:40:18",
        "full_link": "https://www.reddit.com/r/anime/comments/v511q3/what_other_kind_of_anime_takes_it_self_seriously/",
        "selftext": "I've noticed that certain anime takes itself extremely seriously. AOT is a perfect example of this, it is exceptionally dramatic without characters \"breaking\" character with comically exaggerated animations at times of extreme emotion, animals as regular every day characters etc.   \n\n\nHow can I find more of this \"style\" of anime? Monster / Death Note / Mushishi / Initial D are also good examples of this anime I've come across.",
        "subreddit": "anime",
        "title": "What other kind of anime \"takes it self seriously\" like AOT?",
        "created": "Saturday, June 04, 2022 11:40:18",
        "removed_by_category": null,
        "Preprocessed post": "ive noticed that certain anime takes itself extremely seriously aot is a perfect example of this it is exceptionally dramatic without characters breaking character with comically exaggerated animations at times of extreme emotion animals as regular every day characters etc   how can i find more of this style of anime monster  death note  mushishi  initial d are also good examples of this anime ive come across"
    },
    {
        "author": "MannerPots",
        "created_utc": "Sunday, June 05, 2022 07:25:57",
        "full_link": "https://www.reddit.com/r/anime/comments/v50sc8/whats_the_up_to_date_watch_order_for_free/",
        "selftext": "The [subreddit watch order guide](https://old.reddit.com/r/anime/wiki/watch_order#wiki_free.21) for Free! covers most of it, but I don't include the newest entries.\n\nIs Final Stroke the only new required watching, which would come after the entries listed?\n\nOr are there any new OVAs etc. that I should watch?",
        "subreddit": "anime",
        "title": "What's the up to date watch order for Free!?",
        "created": "Saturday, June 04, 2022 11:25:57",
        "removed_by_category": null,
        "Preprocessed post": "the subreddit watch order guide isURL for free covers most of it but i dont include the newest entriesis final stroke the only new required watching which would come after the entries listedor are there any new ovas etc that i should watch"
    },
    {
        "author": "gorillionaire2022",
        "created_utc": "Sunday, June 05, 2022 07:16:44",
        "full_link": "https://www.reddit.com/r/anime/comments/v50m6b/questionhelptitle_of_anime_that_i_saw_a_clip_on/",
        "selftext": "the clip showed some type of military/police force dropping from pods and going to assault some terrorists.\n\n\nDoes this crappy description ring a bell for anyone?\n\nI thought it was Patlabor, but it was not\n\n\nthanks",
        "subreddit": "anime",
        "title": "QUESTION/HELP...title of anime that I saw a clip on yt....military/police force dropping from pods",
        "created": "Saturday, June 04, 2022 11:16:44",
        "removed_by_category": null,
        "Preprocessed post": "the clip showed some type of militarypolice force dropping from pods and going to assault some terroristsdoes this crappy description ring a bell for anyonei thought it was patlabor but it was notthanks"
    },
    {
        "author": "Abyssbringer",
        "created_utc": "Sunday, June 05, 2022 07:00:13",
        "full_link": "https://www.reddit.com/r/anime/comments/v50aq9/ai_city_rewatch_6_day_reminder/",
        "selftext": "This is a reminder that the next movie in the r/anime [mod rewatch](https://reddit.com/r/anime/comments/uh3b7v/announcing_the_modhosted_rewatch_series/) is going to be the very 80's [Ai City](https://anilist.co/anime/5053/Ai-City/)\n\nIn just 6 short days you can experience a [colorful](https://i.imgur.com/Y2Iprhs.png), exciting, and trippy, look into a classic 80's anime style. You got [car chases](https://i.imgur.com/hfxs2fN.png), [neon lights](https://i.imgur.com/Nxz2EHn.png), [psychic powers](https://i.imgur.com/estbDXC.png), and ~~tentacles?~~\n\n[Can you protect love?](https://preview.redd.it/8gyzaoouvn391.png?width=704&amp;format=png&amp;auto=webp&amp;s=7213397d29ac3264149c50af10a8621cc362738b)\n\nFind out in 6 days!  \n\n\n[Come join us!](https://i.imgur.com/oMhUN0h.png) at **6/10 Midnight UTC**\n\nShow Information: [MyAnimeList](https://myanimelist.net/anime/5053/Ai_City) | [AniList](https://anilist.co/anime/5053/Ai-City/) | [Kitsu](https://kitsu.io/anime/ai-city)\n\n**Warning**: This is a pre Porygon anime and as such features many flashing lights. If you have issues with this then please be mindful that this anime contains much of that.",
        "subreddit": "anime",
        "title": "Ai City Rewatch - 6 day Reminder",
        "created": "Saturday, June 04, 2022 11:00:13",
        "removed_by_category": null,
        "Preprocessed post": "this is a reminder that the next movie in the ranime mod rewatch isURL is going to be the very 80s ai city isURLin just 6 short days you can experience a colorful isURL exciting and trippy look into a classic 80s anime style you got car chases isURL neon lights isURL psychic powers isURL and tentaclescan you protect love isURLfind out in 6 days  come join us isURL at 610 midnight utcshow information myanimelist isURL  anilist isURL  kitsu isURLwarning this is a pre porygon anime and as such features many flashing lights if you have issues with this then please be mindful that this anime contains much of that"
    },
    {
        "author": "Delicious-Jicama-105",
        "created_utc": "Sunday, June 05, 2022 06:56:29",
        "full_link": "https://www.reddit.com/r/anime/comments/v5084m/anime_battle_of_the_day_dont_use_false_info_for/",
        "selftext": "Saber alter (with or without avalon) vs. Monkey d luffy\n\nUse any info you can think of and find (btw. Saber is not outerversal or boundless even if the creator says so🤦‍♂️)",
        "subreddit": "anime",
        "title": "anime battle of the day( don't use false info for characters 🤦‍♂️)",
        "created": "Saturday, June 04, 2022 10:56:29",
        "removed_by_category": null,
        "Preprocessed post": "saber alter with or without avalon vs monkey d luffyuse any info you can think of and find btw saber is not outerversal or boundless even if the creator says so"
    },
    {
        "author": "Oh_umms_cocktails",
        "created_utc": "Sunday, June 05, 2022 06:46:24",
        "full_link": "https://www.reddit.com/r/anime/comments/v5015y/what_the_fuck_happened_to_anime_i_feel_like_an/",
        "selftext": "I had a rough childhood, and my mom really tried to make things better by getting involved in my interests. My estranged brother's abandoned PS with a brand new copy of FFVII turned into liking anime, Golgo 13, a Wind Named Amnesia, Vulcan Wars, and by my early teenage years my mom was driving me weekly to the local college campus for anime club (they screened R-rated and obviously couldn't let a 13 year old in without parental permission) where fan subs, and just good old official releases were screened. Cowboy Bebop, Spriggan, Wings of Honneamise, Perfect Blue, Vampire Hunter D: Bloodlust, the Patlabor movies. Sure there were always the silly things (\"I Want to be your Angel\" was my favorite) but even with things like Trigun and Evangelion the dopey ecchi stuff was directly tied into the story in a real way.\n\nIt feels like the last anime I watched that didn't have some 13 year-old kid trip and fall into someone's J sized breasts and wasn't AoT was Black Lagoon. I guess Gangsta is around now but it just sucks. Salaryman Club I enjoy.\n\nEven the good stuff, Spy x Family, Fullmetal Alchemist: Brotherhood, can't not have stupid ecchi crap in it.\n\nI used to love anime because it did sci-fi and fantasy so much better than live-action could do. And while there was always infantile stuff there seemed to be a real place for serious thoughtful story-telling. Now it just seems like even serious stories have to have massive breasts, sauna scenes where some dude gets a peak and has an exaggerated nosebleed, and those dopey cartoon faces with giant teardrops. I'm not saying there aren't serious animes, obviously AoT is a great example, but it seems like even the good ones have *some* ecchi crap in it (I know I mentioned Cowboy Bebop, but even Faye's fan-service was a genuine commentary on the femme fatale trope and Spike never got a nosebleed when he tripped and accidentally grabbed her boob then fell deeply in love with her), and purely serious ones are nearly extinct.\n\nAm I just being a fogey? Was I maybe just exposed to the good stuff out of luck? Or has anime just changed?",
        "subreddit": "anime",
        "title": "What the fuck happened to anime? I feel like an old fogey in a Sabbath short being recommended Machine Gun Kelly.",
        "created": "Saturday, June 04, 2022 10:46:24",
        "removed_by_category": null,
        "Preprocessed post": "i had a rough childhood and my mom really tried to make things better by getting involved in my interests my estranged brothers abandoned ps with a brand new copy of ffvii turned into liking anime golgo 13 a wind named amnesia vulcan wars and by my early teenage years my mom was driving me weekly to the local college campus for anime club they screened rrated and obviously couldnt let a 13 year old in without parental permission where fan subs and just good old official releases were screened cowboy bebop spriggan wings of honneamise perfect blue vampire hunter d bloodlust the patlabor movies sure there were always the silly things i want to be your angel was my favorite but even with things like trigun and evangelion the dopey ecchi stuff was directly tied into the story in a real wayit feels like the last anime i watched that didnt have some 13 yearold kid trip and fall into someones j sized breasts and wasnt aot was black lagoon i guess gangsta is around now but it just sucks salaryman club i enjoyeven the good stuff spy x family fullmetal alchemist brotherhood cant not have stupid ecchi crap in iti used to love anime because it did scifi and fantasy so much better than liveaction could do and while there was always infantile stuff there seemed to be a real place for serious thoughtful storytelling now it just seems like even serious stories have to have massive breasts sauna scenes where some dude gets a peak and has an exaggerated nosebleed and those dopey cartoon faces with giant teardrops im not saying there arent serious animes obviously aot is a great example but it seems like even the good ones have some ecchi crap in it i know i mentioned cowboy bebop but even fayes fanservice was a genuine commentary on the femme fatale trope and spike never got a nosebleed when he tripped and accidentally grabbed her boob then fell deeply in love with her and purely serious ones are nearly extinctam i just being a fogey was i maybe just exposed to the good stuff out of luck or has anime just changed"
    },
    {
        "author": "hdhsbshshabwbwhww",
        "created_utc": "Sunday, June 05, 2022 06:33:26",
        "full_link": "https://www.reddit.com/r/anime/comments/v4zrz7/im_on_episode_29_of_gintama_and_im_not_really/",
        "selftext": "I’ve seen so many people put gintama in their top 10 list but so far there have only been a few good episodes IMO. Does it get better soon?",
        "subreddit": "anime",
        "title": "I’m on episode 29 of gintama and I’m not really enjoying it is there any point in carrying on watching it?",
        "created": "Saturday, June 04, 2022 10:33:26",
        "removed_by_category": null,
        "Preprocessed post": "ive seen so many people put gintama in their top 10 list but so far there have only been a few good episodes imo does it get better soon"
    },
    {
        "author": "REEEEEEEEEEEEEEE110",
        "created_utc": "Sunday, June 05, 2022 06:08:57",
        "full_link": "https://www.reddit.com/r/anime/comments/v4zb2n/does_anyone_know_any_anime_that_are_similar_to/",
        "selftext": "Both of these shows are very special to me because of that unforgettable immersion and tragedy. I know that the danganronpa game is better but it doesn’t capture the same immersion of sitting in the dark at night and watching one episode of a beloved character dying or becoming a murderer. It feels very isolated and it’s great. I haven’t been able to find another anime with the same kind of concept so it would be great if anyone knows one.",
        "subreddit": "anime",
        "title": "Does anyone know any anime that are similar to danganronpa or squid games with some kind of morbid killing game?",
        "created": "Saturday, June 04, 2022 10:08:57",
        "removed_by_category": null,
        "Preprocessed post": "both of these shows are very special to me because of that unforgettable immersion and tragedy i know that the danganronpa game is better but it doesnt capture the same immersion of sitting in the dark at night and watching one episode of a beloved character dying or becoming a murderer it feels very isolated and its great i havent been able to find another anime with the same kind of concept so it would be great if anyone knows one"
    },
    {
        "author": "Alternative_Sea8805",
        "created_utc": "Sunday, June 05, 2022 06:01:47",
        "full_link": "https://www.reddit.com/r/anime/comments/v4z605/bought_a_nesoberi_off_dsmoothake/",
        "selftext": "Does anyone know about this site or have shopped there before? Haven't you seen any reviews?",
        "subreddit": "anime",
        "title": "Bought a Nesoberi off Dsmoothake",
        "created": "Saturday, June 04, 2022 10:01:47",
        "removed_by_category": null,
        "Preprocessed post": "does anyone know about this site or have shopped there before havent you seen any reviews"
    },
    {
        "author": "Stargate18A",
        "created_utc": "Sunday, June 05, 2022 06:00:38",
        "full_link": "https://www.reddit.com/r/anime/comments/v4z563/revue_starlight_rewatch_rondo_rondo_rondo/",
        "selftext": "#**Shoujo☆Kageki Revue Starlight: Rondo Rondo Rondo**\n\n[MAL](https://myanimelist.net/anime/40665/Shoujo%E2%98%86Kageki_Revue_Starlight__Rondo_Rondo_Rondo) | [Anilist](https://anilist.co/anime/113023/ShoujoKageki-Revue-Starlight-Rondo-Rondo-Rondo/) | [Kitsu](https://kitsu.io/anime/shoujo-kageki-revue-starlight-rondo-rondo-rondo) | [AniDB](https://anidb.net/anime/15254) | [ANN](https://www.animenewsnetwork.com/encyclopedia/anime.php?id=22992)\n\n\n[Previous](https://old.reddit.com/r/anime/comments/v4a7jk/revue_starlight_rewatch_ovas_discussion/) | [Index](https://old.reddit.com/r/anime/comments/txxly8/rewatch_revue_starlight_rewatch_announcement/) | [Next](https://staging.animethemes.moe/video/ShoujoKagekiRevueStarlight-OP1.webm)\n\nStar Diamond live (highly recommend you watch this) - [Starry Diamond]() Processing!\n\n[HAPPY](https://i.imgur.com/AZodue7.png) [BIRTHDAY,](https://i.imgur.com/Gfo75aj.png) [YUYUKO!](https://i.imgur.com/RDNJfin.png)\n\nToday's Re LIVE Cards - [\"BanG Dream! Collab Performance Initial\"](https://imgur.com/a/uSeYI85)\n\nBonus Collab Re LIVE Cards - [\"Sakura Wars Collab Performance Gracefully Blooming Maidens\"](https://imgur.com/a/D0mn6gJ)\n\nBonus - [Yuyuko Birthday Cards!](https://imgur.com/a/4NWSMsA)\n\nQuestions of the Day:\n\n1) First-timers - what do you think the ending scene means? Any predictions for the movie's plot?\n\n2) Lots of new remixes this movie - which did you like the most?\n\n3) Does Star Diamond fit the revue better than Star Divine?\n\nComments of the Day:\n\n/u/archlon [gave us a surprising amount of analysis, complete with Terry Pratchett quote](https://old.reddit.com/r/anime/comments/v4a7jk/revue_starlight_rewatch_ovas_discussion/ib349rq/).\n\n/u/NecoDelero [actually watched Shoujo Conto](https://old.reddit.com/r/anime/comments/v4a7jk/revue_starlight_rewatch_ovas_discussion/ib34qvq/)?\n\n/u/Shimmering-Sky [had some great reactions](https://old.reddit.com/r/anime/comments/v4a7jk/revue_starlight_rewatch_ovas_discussion/ib34f39/).\n\nFinally, /u/RadSuit [made a very good point](https://old.reddit.com/r/anime/comments/v4a7jk/revue_starlight_rewatch_ovas_discussion/ib3ftdk/).\n\n&gt; And yup, Karen is an idiot. Could've probably bought that toy online and had it shipped weeks ago.\n\nMake sure to post your Visual of the Day!\n\n[Yesterday's VOTDs](https://imgur.com/a/CuPtdJ3)\n\nOn an important note, no unmarked spoilers! No jokes about events yet to come, and no references to future episode numbers!",
        "subreddit": "anime",
        "title": "Revue Starlight Rewatch - Rondo Rondo Rondo Discussion",
        "created": "Saturday, June 04, 2022 10:00:38",
        "removed_by_category": null,
        "Preprocessed post": "shoujokageki revue starlight rondo rondo rondomal isURL  anilist isURL  kitsu isURL  anidb isURL  ann isURLprevious isURL  index isURL  next isURLstar diamond live highly recommend you watch this  starry diamond processinghappy isURL birthday isURL yuyuko isURLtodays re live cards  bang dream collab performance initial isURLbonus collab re live cards  sakura wars collab performance gracefully blooming maidens isURLbonus  yuyuko birthday cards isURLquestions of the day1 firsttimers  what do you think the ending scene means any predictions for the movies plot2 lots of new remixes this movie  which did you like the most3 does star diamond fit the revue better than star divinecomments of the dayuarchlon gave us a surprising amount of analysis complete with terry pratchett quote isURLunecodelero actually watched shoujo conto isURLushimmeringsky had some great reactions isURLfinally uradsuit made a very good point isURLgt and yup karen is an idiot couldve probably bought that toy online and had it shipped weeks agomake sure to post your visual of the dayyesterdays votds isURLon an important note no unmarked spoilers no jokes about events yet to come and no references to future episode numbers"
    },
    {
        "author": "Shimmering-Sky",
        "created_utc": "Sunday, June 05, 2022 06:00:05",
        "full_link": "https://www.reddit.com/r/anime/comments/v4z4ld/listen_to_my_song_senki_zesshou_symphogear/",
        "selftext": "#**Episode 4 - [Falling Tears](https://i.imgur.com/lfLMM71.png)**\n\n[← Previous Episode](https://old.reddit.com/r/anime/comments/v4a5py/listen_to_my_song_senki_zesshou_symphogear/) | [Index](https://old.reddit.com/r/anime/comments/uihqct/listen_to_my_song_senki_zesshou_symphogear/) | [Next Episode →](https://animethemes.moe/video/Symphogear-ED2.webm)\n\n[MAL](https://myanimelist.net/anime/11751/Senki_Zesshou_Symphogear) | [AniList](https://anilist.co/anime/11751/Senki-Zesshou-Symphogear/) | [ANN](https://www.animenewsnetwork.com/encyclopedia/anime.php?id=13659) | [Kitsu](https://kitsu.io/anime/senki-zesshou-symphogear-meteoroid-falling-burning-and-disappear-then) | [AniDB](https://anidb.net/anime/8709)\n\n[Crunchyroll](https://www.crunchyroll.com/symphogear) \n\n~~It is highly recommended to track down a fansub for this show instead of using Crunchyroll, though.~~\n\n-----\n\n***I am a sword. I will not break here.***\n\n**Questions of the Day:**\n\n1) What are your first impressions of the girl wearing the Nehushtan Armor?\n\n2) Would you be able to sing a zesshou, knowing it could cost your life?\n\n**Wallpaper of the Day:**\n\n[I Am A Sword](https://i.imgur.com/BoOwQzk.png)\n\n-----\n\nRewatchers, please remember to be mindful of all the first-timers in this. No talking about or hinting at future events no matter how much you want to, ***unless*** you’re doing it underneath [spoiler tags](https://old.reddit.com/r/anime/comments/q28ulr/announcing_changes_to_spoiler_tags/). Don’t spoil anything for the first-timers, that’s rude!",
        "subreddit": "anime",
        "title": "[Listen to My Song] Senki Zesshou Symphogear Episode 4 Discussion",
        "created": "Saturday, June 04, 2022 10:00:05",
        "removed_by_category": null,
        "Preprocessed post": "episode 4  falling tears isURL previous episode isURL  index isURL  next episode  isURLmal isURL  anilist isURL  ann isURL  kitsu isURL  anidb isURLcrunchyroll isURL it is highly recommended to track down a fansub for this show instead of using crunchyroll thoughi am a sword i will not break herequestions of the day1 what are your first impressions of the girl wearing the nehushtan armor2 would you be able to sing a zesshou knowing it could cost your lifewallpaper of the dayi am a sword isURLrewatchers please remember to be mindful of all the firsttimers in this no talking about or hinting at future events no matter how much you want to unless youre doing it underneath spoiler tags isURL dont spoil anything for the firsttimers thats rude"
    },
    {
        "author": "NecessaryDamage133",
        "created_utc": "Sunday, June 05, 2022 05:44:36",
        "full_link": "https://www.reddit.com/r/anime/comments/v4yu0k/cant_remember_the_title/",
        "selftext": "Hey guys I need help with something...so I've been trying to find  this certain anime but I don't remember the name, all I remember is a scene from it.\n\nIt showed this guy throwing a girl out a window (I think he had sliver hair... I'm not to sure) then he jumped out and he was transforming into a demon of some sort.( Sorry I'm not sure lol) can anyone help me that would be great 😊",
        "subreddit": "anime",
        "title": "Can't remember the title",
        "created": "Saturday, June 04, 2022 09:44:36",
        "removed_by_category": null,
        "Preprocessed post": "hey guys i need help with somethingso ive been trying to find  this certain anime but i dont remember the name all i remember is a scene from itit showed this guy throwing a girl out a window i think he had sliver hair im not to sure then he jumped out and he was transforming into a demon of some sort sorry im not sure lol can anyone help me that would be great "
    },
    {
        "author": "OiItzAtlas",
        "created_utc": "Sunday, June 05, 2022 05:22:06",
        "full_link": "https://www.reddit.com/r/anime/comments/v4yemo/i_have_trivial_thing_to_get_upset_at/",
        "selftext": "Why can’t anime get spiders right? They always show webbing coming out of their mouth when it comes from the spinnerets (which is on its backside). \n\nEither way it doesn’t matter but I find it interesting that anime regularly shows it wrong.",
        "subreddit": "anime",
        "title": "I have trivial thing to get upset at",
        "created": "Saturday, June 04, 2022 09:22:06",
        "removed_by_category": null,
        "Preprocessed post": "why cant anime get spiders right they always show webbing coming out of their mouth when it comes from the spinnerets which is on its backside either way it doesnt matter but i find it interesting that anime regularly shows it wrong"
    },
    {
        "author": "PheonixFlies65",
        "created_utc": "Sunday, June 05, 2022 05:20:34",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ydks/as_a_wattpad_creator/",
        "selftext": "Hi I've recently done an anime fanfic, which contains my OC's. And My favorite anime. (OFC, there are disclaimers.) \n\nIt would be very helpful if you could hop in and give me some support on writing more chapters!   \n[https://www.wattpad.com/myworks/298473114-greekish-anime-book-2-pjo-x-anime](https://www.wattpad.com/myworks/298473114-greekish-anime-book-2-pjo-x-anime)\n\nFeel free to visit my other books as well.   \nThank you all!",
        "subreddit": "anime",
        "title": "As a wattpad creator...",
        "created": "Saturday, June 04, 2022 09:20:34",
        "removed_by_category": null,
        "Preprocessed post": "hi ive recently done an anime fanfic which contains my ocs and my favorite anime ofc there are disclaimers it would be very helpful if you could hop in and give me some support on writing more chapters    isURLfeel free to visit my other books as well   thank you all"
    },
    {
        "author": "ATargetFinderScrub",
        "created_utc": "Sunday, June 05, 2022 05:05:49",
        "full_link": "https://www.reddit.com/r/anime/comments/v4y35e/weekly_seasonal_rankings_spring_2022_week_9/",
        "selftext": "Hello everyone, and welcome to this week's Weekly Seasonal Rankings discussion! Here, you can rank and comment on all of the currently airing anime you’re watching each week basis, as well as discuss your opinions with the rest of /r/anime. For an example of how this works, [check out this thread from a while back]( https://www.reddit.com/r/anime/comments/6nibe2/weekly_seasonal_rankings_summer_2017_week_2/).\n\nYou can format your rankings however you want, from simple lists to making a cool graphic. We even had someone use Excel! The most common way to do things is using a reddit table though. If you haven't made one, you can learn how to make one [here](https://www.reddit.com/r/tabled/wiki/table-format) or [here](https://www.reddit.com/r/tabled/comments/pt0wy/my_guide_to_making_successful_tables/). You could also use this [website](https://www.tablesgenerator.com/markdown_tables), which will format your table to suit reddit.",
        "subreddit": "anime",
        "title": "Weekly Seasonal Rankings: Spring 2022 - Week 9",
        "created": "Saturday, June 04, 2022 09:05:49",
        "removed_by_category": null,
        "Preprocessed post": "hello everyone and welcome to this weeks weekly seasonal rankings discussion here you can rank and comment on all of the currently airing anime youre watching each week basis as well as discuss your opinions with the rest of ranime for an example of how this works check out this thread from a while back  isURLyou can format your rankings however you want from simple lists to making a cool graphic we even had someone use excel the most common way to do things is using a reddit table though if you havent made one you can learn how to make one here isURL or here isURL you could also use this website isURL which will format your table to suit reddit"
    },
    {
        "author": "graveyardparade",
        "created_utc": "Sunday, June 05, 2022 05:05:09",
        "full_link": "https://www.reddit.com/r/anime/comments/v4y2o9/anime_merch_naoki_urasawa_trigun_vinland_saga/",
        "selftext": "Hello, r/anime! I've been searching for merch for the titles above (Urasawa works, Trigun, Vinland Saga, Kekkiashi, Princess Tutu and Gungrave). I haven't actually watched most of these myself, but a friend of mine is going through a really difficult time, and I would love to get her something really nice that corresponds to her interests. I'm not too interested in just manga/anime images laserprinted on t-shirts -- I'd love to get her something heftier, like an artbook, but I've had a hard time finding merch for these series. Do any fans of these manga/anime have any suggestions or know of any merch that they themselves would love to receive beyond t-shirts and stickers over on redbubble/etsy/etc.? The best things I've been able to find are some artbooks for Vinland Saga by Wit Studio, but unfortunately they're all sold out &amp; resellers have totally gouged the prices.  \n\n\nThanks in advance for any ideas you might have! I really appreciate it!",
        "subreddit": "anime",
        "title": "Anime Merch? (Naoki Urasawa, Trigun, Vinland Saga, Kekkiashi, Princess Tutu, Gungrave)",
        "created": "Saturday, June 04, 2022 09:05:09",
        "removed_by_category": null,
        "Preprocessed post": "hello ranime ive been searching for merch for the titles above urasawa works trigun vinland saga kekkiashi princess tutu and gungrave i havent actually watched most of these myself but a friend of mine is going through a really difficult time and i would love to get her something really nice that corresponds to her interests im not too interested in just mangaanime images laserprinted on tshirts  id love to get her something heftier like an artbook but ive had a hard time finding merch for these series do any fans of these mangaanime have any suggestions or know of any merch that they themselves would love to receive beyond tshirts and stickers over on redbubbleetsyetc the best things ive been able to find are some artbooks for vinland saga by wit studio but unfortunately theyre all sold out amp resellers have totally gouged the prices  thanks in advance for any ideas you might have i really appreciate it"
    },
    {
        "author": "A_Idiot0",
        "created_utc": "Sunday, June 05, 2022 05:00:41",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xzdj/violet_evergarden_rewatch_2022_1_week_reminder/",
        "selftext": "# “I love you.”\n\nWords are instruments by which we convey ideas and emotions.  With these instruments, we play the notes of our thoughts, and when played with another we create songs of conversations.  Altogether, those conversations form an opus of understanding.  The story of Violet Evergarden is an opus about the word Love.\n\nhttps://preview.redd.it/eml7wb5u4o391.png?width=2560&amp;format=png&amp;auto=webp&amp;s=af2e83284e2655a59517b48324728352611a7b5e\n\nHello everyone!  I hope this post finds you well.  This is the 1 week reminder thread for the [2022 Violet Evergarden Rewatch](https://www.reddit.com/r/anime/comments/ujwn2t/violet_evergarden_rewatch_2022_announcement/).  Starting June 11th, I will be posting the host thread at **2pm PDT / 9pm UTC every day until June 27th**.  If you need help figuring out what time that is in your zone, please don’t hesitate to ask below. We will be watching and discussing one episode per day.\n\nYou can find the schedule, as well as much more information about what will be in this rewatch, on the main announcement thread, which I will [link here](https://www.reddit.com/r/anime/comments/ujwn2t/violet_evergarden_rewatch_2022_announcement/).  If you would like to be added to my reminder ping list for the 24 hour reminder post on June 10th, please let me know down below in the comments and I’ll be sure to add you.\n\n## A quick note about the Auto Memory Doll Service Discord project\n\nWe want to help you write letters that will say the things that are difficult or impossible to say in any other way, much like the auto memory dolls do in the world of Violet Evergarden. My colleagues and I (Daffodil) are eager and excited to write letters on your behalf, so feel free to come by and request a letter from us!  Here is the link to our server: [https://discord.gg/GNmdT257](https://discord.gg/GNmdT257)\n\nIf you have any other questions, please don’t hesitate to ask.  I’m looking forward to hosting everyone as best as I can. \n\nSincerely,   \nA\\_Idiot0 (Daffodil)\n\n*Processing img 9v9uk8ru4o391...*",
        "subreddit": "anime",
        "title": "Violet Evergarden Rewatch 2022 1 Week Reminder",
        "created": "Saturday, June 04, 2022 09:00:41",
        "removed_by_category": null,
        "Preprocessed post": " i love youwords are instruments by which we convey ideas and emotions  with these instruments we play the notes of our thoughts and when played with another we create songs of conversations  altogether those conversations form an opus of understanding  the story of violet evergarden is an opus about the word love isURLhello everyone  i hope this post finds you well  this is the 1 week reminder thread for the 2022 violet evergarden rewatch isURL  starting june 11th i will be posting the host thread at 2pm pdt  9pm utc every day until june 27th  if you need help figuring out what time that is in your zone please dont hesitate to ask below we will be watching and discussing one episode per dayyou can find the schedule as well as much more information about what will be in this rewatch on the main announcement thread which i will link here isURL  if you would like to be added to my reminder ping list for the 24 hour reminder post on june 10th please let me know down below in the comments and ill be sure to add you a quick note about the auto memory doll service discord projectwe want to help you write letters that will say the things that are difficult or impossible to say in any other way much like the auto memory dolls do in the world of violet evergarden my colleagues and i daffodil are eager and excited to write letters on your behalf so feel free to come by and request a letter from us  here is the link to our server  isURLif you have any other questions please dont hesitate to ask  im looking forward to hosting everyone as best as i can sincerely   a_idiot0 daffodilprocessing img 9v9uk8ru4o391"
    },
    {
        "author": "Taiboss",
        "created_utc": "Sunday, June 05, 2022 05:00:07",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xytd/rewatch_utawarerumono_franchise_rewatch/",
        "selftext": "#**Episode 2 - The Righteous Man**\n\n\n[← Episode 1](https://old.reddit.com/r/anime/comments/v48x15/rewatch_utawarerumono_franchise_rewatch/) | [Index](https://old.reddit.com/r/anime/comments/tu1fqj/utawarerumono_franchise_rewatch_official/) | [Next Episode →](https://staging.animethemes.moe/video/UtawarerumonoItsuwariNoKamen-ED1.webm)\n\n**[MyAnimeList](https://myanimelist.net/anime/856/), [Anime-Planet](https://www.anime-planet.com/anime/utawarerumono-the-false-faces), [Anilist](https://anilist.co/anime/856/Utawarerumono/), [ANN](https://www.animenewsnetwork.com/encyclopedia/anime.php?id=5746)**\n\n[HiDive](https://www.hidive.com/tv/utawarerumono-the-false-faces-)\n\n-----\n\n**Today's Question of the Day**: So Haku and Kuon are quite different from Hakuowlo and Eruru. Who, respectively, do you prefer so far?\n\n[Tomorrow's Question of the Day]&gt;!How fucking cute are Ruru and Kokopo?!&lt;\n\n**Rewatchers, please don't answer the Question of the Day if it has an objective answer, e.g. \"What do you think's gonna happen?\"**\n\n-----\n\n### **Art of the day:** [Kuon again!](https://i.redd.it/fff5lj1lw6a71.jpg) ([Source](https://twitter.com/bcm55838899/status/1412459402183929858/photo/1))\n\n-----\n\n### For rewatchers and people who played the games:\nPlease behave yourself! Put not only everything related to future events behind [spoiler tags](https://old.reddit.com/r/anime/comments/q28ulr/announcing_changes_to_spoiler_tags/), but **tag differences to the games as well.** We all know there are deviations and cut content, we don't need someone listing all the things the games did better. The games have like 40, 50 hours for their content each, of course they'll be more exhaustive. If you want to talk about the games, please do this in a way that doesn't spoil it for people who might pick them up because of the anime. That being said, small, inconsequential stuff is *probably* fine, like [Mask of Deception]&gt;!how in one episode, Atuy says \"Time for war!\", one of her battle lines in the games!&lt;. All in all, try to hold back and only tell first-timers what's really necessary. Let them theorise! \n\n**This goes especially for Mask of Truth!** \n\n### First-Timers:\n\nDue to spoilers, I recommend you **not to watch the Opening before episode 5.** This time it's not that important, but still. [DO LISTEN TO IT THOUGH!](https://www.youtube.com/watch?v=phv6zRlIEyU) You don't *have* to heed this request, of course, but out of courtesy to those who do, please put the spoilers in the OP behind spoiler tags as well.\n\n**Next episode has an after-credits scene!**",
        "subreddit": "anime",
        "title": "[Rewatch] Utawarerumono Franchise Rewatch - Utawarerumono Itsuwari no Kamen Episode 2 Discussion",
        "created": "Saturday, June 04, 2022 09:00:07",
        "removed_by_category": null,
        "Preprocessed post": "episode 2  the righteous man episode 1 isURL  index isURL  next episode  isURLmyanimelist isURL animeplanet isURL anilist isURL ann isURLhidive isURLtodays question of the day so haku and kuon are quite different from hakuowlo and eruru who respectively do you prefer so fartomorrows question of the daygthow fucking cute are ruru and kokopoltrewatchers please dont answer the question of the day if it has an objective answer eg what do you thinks gonna happen art of the day kuon again isURL source isURL for rewatchers and people who played the gamesplease behave yourself put not only everything related to future events behind spoiler tags isURL but tag differences to the games as well we all know there are deviations and cut content we dont need someone listing all the things the games did better the games have like 40 50 hours for their content each of course theyll be more exhaustive if you want to talk about the games please do this in a way that doesnt spoil it for people who might pick them up because of the anime that being said small inconsequential stuff is probably fine like mask of deceptiongthow in one episode atuy says time for war one of her battle lines in the gameslt all in all try to hold back and only tell firsttimers whats really necessary let them theorise this goes especially for mask of truth  firsttimersdue to spoilers i recommend you not to watch the opening before episode 5 this time its not that important but still do listen to it though isURL you dont have to heed this request of course but out of courtesy to those who do please put the spoilers in the op behind spoiler tags as wellnext episode has an aftercredits scene"
    },
    {
        "author": "Tarhalindur",
        "created_utc": "Sunday, June 05, 2022 05:00:04",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xys8/rewatch_higurashi_no_naku_koro_ni_discussion/",
        "selftext": "#**Watanagashi-hen (Cotton Drifting Chapter), Episode 1: **\n\n← [Previous Episode](https://old.reddit.com/r/anime/comments/v48x86/rewatch_higurashi_no_naku_koro_ni_discussion/) | [Index](https://old.reddit.com/r/anime/comments/ux0x0x/og_higurashi_rewatch_1week_reminder_and_de_facto/) | Next Episode →\n\n##**Show Information (Season 1):**  \n\n[MAL](https://myanimelist.net/anime/934) | [Anilist](https://anilist.co/anime/934/Higurashi-no-Naku-Koro-ni/) | [AniDB](https://anidb.net/anime/3574) | [Kitsu](https://kitsu.io/anime/higurashi-no-naku-koro-ni) | [ANN](https://www.animenewsnetwork.com/encyclopedia/anime.php?id=6134)  \n\n##**Legal Streams:**\n\n**Higurashi no Naku Koro Ni**: [Hidive](https://www.hidive.com/tv/when-they-cry) | [Netflix](https://www.netflix.com/title/70308793) (not available in the US; if you are out of the US check your country for availability)  \n\n##**Two Words of Warning To Our First-Timers, Including Those Who Watched Season 1 But Not Kai:**\n\n1) Be wary of looking up anything, even names.  The Season 1 summaries on the information pages are safe, but it's not hard to run into spoiler information even through something as innocuous as looking at cast lists - gods help you if you go on the Fandom Wikia.  **UNDER ABSOLUTELY NO CIRCUMSTANCES GO LOOKING AT EVEN OFFICIAL INFO FOR KAI OR LATER AHEAD OF TIME.** (The official image for Rei is 100% a spoiler, for example.)  **Also, do NOT look at any Kitsu page after the first season; Kai's description on Kitsu is in fact a major spoiler.**  Like, really, just stay out of anything that isn't a basic Season 1 summary until you're done.  It's much safer that way.\n\n2) **Also, be wary of potentially running into spoilers on the r/anime front page on June 19 or thereabouts this year**; there is suspicion that some sort of new Higurashi anime project will be announced on that date (this year is the 20th anniversary of the release of the original Onikakushi-hen VN - hence why I am running this rewatch this year! - and multiple official accounts have teased an announcement on that date), and you could run into spoilers that way.  (Those of you who remember the Madoka rewatch last year will recognize the issue, though admittedly I expect Sotsu was enough of a disappointment to significantly reduce the risk - at least relative to the potential that was in fact realized with the Walpurgis no Kaiten announcment.)\n\n##**A Reminder to Rewatchers**  \n\nPlease do not spoil the experience for first-timers; this is a mystery after all.  In particular, ~~Shion is a spoiler until Episode 5~~ and [Higurashi] &gt;!Hanyuu is a spoiler until Minagoroshi-hen.  Also, the glorious nipah is indeed glorious but Rika does not use it until Himatsubushi-hen.!&lt;  Please keep these in mind!  \n\n\n##**A Reminder to Rewatchers, Reiterated**  \n\nSince ***somebody*** forgot that something was a spoiler last time and inadvertently spoiled a first-timer in the process: *Please do not spoil the experience for first-timers; this is a mystery after all.*  Consider whether what you are saying has actually been revealed yet on-screen before you post!\n\n##**(Time for) Club Activities!**\n\n(Alexa play \"Shoubu!\"!  Except do **NOT** look that up that song name on YouTube just yet if you're a first-timer, the most classic upload has an ***obnoxious*** spoiler in the visuals...)\n\n**Visual of the Day Album:**\n\nhttps://imgur.com/a/mqmXGuu\n\n**Theory of the Day:**\n\nAlright u/Star4ce, time to collect your first instance of an award you have clearly been gunning for (good job!) courtesy of [this one](https://old.reddit.com/r/anime/comments/v48x86/rewatch_higurashi_no_naku_koro_ni_discussion/ib4hn3o/):\n\n&gt;I'm more particular that another group of (non-supernatural) people have set up camp here and do some shady N.E.R.V.-kind of shit and all the ruckus of demons and ritual murders is both a cover and method for silencing people coming too close to the truth. Cloning? Human experimentation on mind transfer/control? Creating life? Another set of psychopaths trying to summon an actual demon or driving them out?\n\n**Analysis of the Day:**\n\nOkay, so we have two worthy winners today and I can't choose so it's going to be a draw!\n\nFirst, there's u/Nazenn with [these thoughts on the show's execution](https://old.reddit.com/r/anime/comments/v48x86/rewatch_higurashi_no_naku_koro_ni_discussion/ib32wmj/):\n\n&gt;Rena freaks me the fuck out. Something about the way she always know what he's doing and the way the girls predator-selves have an almost reckless disregard for keeping up appearances when talking with him, it just gives me the feeling that their obsession with him is beyond their own control, and driven by something beyond just wanting him around because they said so. It creates this really strange almost double dynamic where every pairing of characters is on completely uncertain ground as to how they'll effect each other becuase of how quickly things can change. It leaves the show feeling unpredictable on a small scale but without the over-convenience or randomness that often bogs down shows with this sort of set up.\n&gt;\n&gt;\n&gt;\n&gt;The final scene with Keiichi feeling like Oyashiro-sama is behind him, the shadow stuck to his back, after being drugged once again has me questioning what the alt-girls really are, and how much of this is ties to psychology and culture over anything more explicitly surreal.\n\nAnd second there is u/EsquilaxM [giving the mystery the level of thought it deserves](https://old.reddit.com/r/anime/comments/v48x86/rewatch_higurashi_no_naku_koro_ni_discussion/ib3n722/):\n\n&gt;Major thing that's bugging me right now. Is why they only tore out part of the note...Or rather, why they chose those specific parts of the note to leave behind? Having him saying his life is in danger and blaming the girls makes sense if they're painting him as psychotic. But letting him inform the police of a van with 4 men doesn't make sense, because vehicles can be tracked...They can probably assume he's already told the police about the van that tried to run him over, so maybe they're trying to play off the van as part of the psychosis? (The drug/syringe is obviously the one bit of evidence that would cause the psychosis/supernatural theory to be damaged. So they're hoping the rest of the note will feed into the myth...They likely manipulated the other suicide note similarly? Though we've not seen it and it doesn't appear on TIPS)\n&gt;\n&gt;\n&gt;\n&gt;Another thing that's coming to mind is the man at the door is obviously (or intentionally looks like) the local village doctor. So when the doctor gave him that superfluous shot, that could've been an opportunity to drug Keichi...But I can't think of anything that happened that day that would be suspicious. Of course it could be that he blacked out and we werne't shown it, but he blacked out straight away in this episode so seems unlikely (but not impossible so I guess keep it in mind?)\n&gt;\n&gt;\n&gt;\n&gt;(Another thing that's bugging me is that he couldn't fight off Mion and Rena when his legs were free, I figure he'd at least have enough strength to make it clear that he was being injected with something through the trauma sites, but then I guess the same thing happened with the photographer, though he had more assailants...I'm just gonna chalk this up to narrative convenience, but it makes the death feel a bit like a cop out)\n\nKeep 'em coming!\n\n**Question(s) of the Day:**\n\n1) [What is your](https://v.animethemes.moe/Chihayafuru-OP1.webm)... excuse me, what is your favorite game?\n\n2) [Do you](https://v.animethemes.moe/RozenMaiden-OP1.webm)... excuse me, do you like dolls?\n\n##**Next Episode Preview:**\n\nOkay, so: Season 1's next episode previews are in the form of a short, strange poem (whose formatting is borrowed from the VNs).  They are not spoilers.  (Kai's can be another matter, but we'll get there when we get there.)  However, my subs often translate the text on the screen... which are, in fact, lines out of context from the next episode.  \n\nSo, for anyone who really doesn't want to take a risk, here is the poem:\n\n\"What I want to see is the shape in the dark.  \nWhat I want to hear are the hesitating footfalls.  \nWhat I want to know is where I really belong.\"",
        "subreddit": "anime",
        "title": "[Rewatch] Higurashi no Naku Koro Ni Discussion - Season 1, Episode 5",
        "created": "Saturday, June 04, 2022 09:00:04",
        "removed_by_category": null,
        "Preprocessed post": "watanagashihen cotton drifting chapter episode 1  previous episode isURL  index isURL  next episode show information season 1  mal isURL  anilist isURL  anidb isURL  kitsu isURL  ann isURL  legal streamshigurashi no naku koro ni hidive isURL  netflix isURL not available in the us if you are out of the us check your country for availability  two words of warning to our firsttimers including those who watched season 1 but not kai1 be wary of looking up anything even names  the season 1 summaries on the information pages are safe but its not hard to run into spoiler information even through something as innocuous as looking at cast lists  gods help you if you go on the fandom wikia  under absolutely no circumstances go looking at even official info for kai or later ahead of time the official image for rei is 100 a spoiler for example  also do not look at any kitsu page after the first season kais description on kitsu is in fact a major spoiler  like really just stay out of anything that isnt a basic season 1 summary until youre done  its much safer that way2 also be wary of potentially running into spoilers on the ranime front page on june 19 or thereabouts this year there is suspicion that some sort of new higurashi anime project will be announced on that date this year is the 20th anniversary of the release of the original onikakushihen vn  hence why i am running this rewatch this year  and multiple official accounts have teased an announcement on that date and you could run into spoilers that way  those of you who remember the madoka rewatch last year will recognize the issue though admittedly i expect sotsu was enough of a disappointment to significantly reduce the risk  at least relative to the potential that was in fact realized with the walpurgis no kaiten announcmenta reminder to rewatchers  please do not spoil the experience for firsttimers this is a mystery after all  in particular shion is a spoiler until episode 5 and higurashi gthanyuu is a spoiler until minagoroshihen  also the glorious nipah is indeed glorious but rika does not use it until himatsubushihenlt  please keep these in mind  a reminder to rewatchers reiterated  since somebody forgot that something was a spoiler last time and inadvertently spoiled a firsttimer in the process please do not spoil the experience for firsttimers this is a mystery after all  consider whether what you are saying has actually been revealed yet onscreen before you posttime for club activitiesalexa play shoubu  except do not look that up that song name on youtube just yet if youre a firsttimer the most classic upload has an obnoxious spoiler in the visualsvisual of the day album isURLtheory of the dayalright ustar4ce time to collect your first instance of an award you have clearly been gunning for good job courtesy of this one isURLgtim more particular that another group of nonsupernatural people have set up camp here and do some shady nervkind of shit and all the ruckus of demons and ritual murders is both a cover and method for silencing people coming too close to the truth cloning human experimentation on mind transfercontrol creating life another set of psychopaths trying to summon an actual demon or driving them outanalysis of the dayokay so we have two worthy winners today and i cant choose so its going to be a drawfirst theres unazenn with these thoughts on the shows execution isURLgtrena freaks me the fuck out something about the way she always know what hes doing and the way the girls predatorselves have an almost reckless disregard for keeping up appearances when talking with him it just gives me the feeling that their obsession with him is beyond their own control and driven by something beyond just wanting him around because they said so it creates this really strange almost double dynamic where every pairing of characters is on completely uncertain ground as to how theyll effect each other becuase of how quickly things can change it leaves the show feeling unpredictable on a small scale but without the overconvenience or randomness that often bogs down shows with this sort of set upgtgtgtgtthe final scene with keiichi feeling like oyashirosama is behind him the shadow stuck to his back after being drugged once again has me questioning what the altgirls really are and how much of this is ties to psychology and culture over anything more explicitly surrealand second there is uesquilaxm giving the mystery the level of thought it deserves isURLgtmajor thing thats bugging me right now is why they only tore out part of the noteor rather why they chose those specific parts of the note to leave behind having him saying his life is in danger and blaming the girls makes sense if theyre painting him as psychotic but letting him inform the police of a van with 4 men doesnt make sense because vehicles can be trackedthey can probably assume hes already told the police about the van that tried to run him over so maybe theyre trying to play off the van as part of the psychosis the drugsyringe is obviously the one bit of evidence that would cause the psychosissupernatural theory to be damaged so theyre hoping the rest of the note will feed into the myththey likely manipulated the other suicide note similarly though weve not seen it and it doesnt appear on tipsgtgtgtgtanother thing thats coming to mind is the man at the door is obviously or intentionally looks like the local village doctor so when the doctor gave him that superfluous shot that couldve been an opportunity to drug keichibut i cant think of anything that happened that day that would be suspicious of course it could be that he blacked out and we wernet shown it but he blacked out straight away in this episode so seems unlikely but not impossible so i guess keep it in mindgtgtgtgtanother thing thats bugging me is that he couldnt fight off mion and rena when his legs were free i figure hed at least have enough strength to make it clear that he was being injected with something through the trauma sites but then i guess the same thing happened with the photographer though he had more assailantsim just gonna chalk this up to narrative convenience but it makes the death feel a bit like a cop outkeep em comingquestions of the day1 what is your isURL excuse me what is your favorite game2 do you isURL excuse me do you like dollsnext episode previewokay so season 1s next episode previews are in the form of a short strange poem whose formatting is borrowed from the vns  they are not spoilers  kais can be another matter but well get there when we get there  however my subs often translate the text on the screen which are in fact lines out of context from the next episode  so for anyone who really doesnt want to take a risk here is the poemwhat i want to see is the shape in the dark  what i want to hear are the hesitating footfalls  what i want to know is where i really belong"
    },
    {
        "author": "rednamrahC",
        "created_utc": "Sunday, June 05, 2022 04:59:44",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xyjd/im_a_bodypainter_and_this_week_i_painted_myself/",
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/4baw0ov24o391.jpg?width=2131&amp;format=pjpg&amp;auto=webp&amp;s=3a41829e2877926173cfc708004a6ce14b81837f",
        "subreddit": "anime",
        "title": "I'm a bodypainter and this week I painted myself into Maid Mask from High-Rise Invasion. I hope you like it!",
        "created": "Saturday, June 04, 2022 08:59:44",
        "removed_by_category": null,
        "Preprocessed post": "ampx200b isURL"
    },
    {
        "author": "Any_Solid_327",
        "created_utc": "Sunday, June 05, 2022 04:58:39",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xxr0/why_naruto_and_sakura_should_be_together/",
        "selftext": "Ultimately Sakura and Sasuke never really had any room to develop as a pairing, for many reasons...\n\nOne Sided: For anyone that's watched the show, this is pretty clear and needs little explanation. Part 1 was Sasuke and Sakura with two polar opposite ambitions. Overall it was mostly Sakura trying to get Sasuke's attention while Sasuke would give her the cold shoulder. Shippuden was even worse...\n\nSasuke going rogue: By this point during the plot, Sakura hasn't seen Sasuke in years. While Sasuke is meanwhile in ties with someone who plans on destroying the leaf. There's not much reason why she's still harboring \"romantic\" feelings by this point.\n\nSasuke turning evil: By this point... it's beyond reasoning how someone can attempt to kill someone twice, make it clear he wants to destroy a village that harbors many friends and family of that said person... only for the person to still \"love\" him.\n\nNo Screentime: Overall with Sasuke going rogue and on the other side, there was simply no area where Sakura and Sasuke could have built chemistry for a grand majority of shippuden.\n\nDerailed Sakura's character: Sakura spent half of her character development rationalizing her undying \"love\" for Sasuke. She started off well in Shippuden working to make herself of aid to Naruto... but that quickly nosedived ever since the Itachi pursuit arc. Overall many wierd and dumb decisions by her, especially in the Kage Summit arc. And even insanely was stuck on Sasuke's feelings... while they were fighting MADARA.\n\nIn the case of Naruto and Sakura however...\n\nMore potential development: The amount of screentime Naruto and Sakura shared throughout Part 1 and shippuden was immense. There was more than enough opportunites to squeeze some potential development, especially for the first half in shippuden.\n\nChemistry: Sakura had become a lot more caring towards Naruto as Part 1 came along. It's relatively clear the amount of care Naruto has harbored towards Sakura since the beggining of the series. By Shippuden, the amount of care the two had for each other had became equal. Throughout the plot, the two have had rather friendly back and forths that were rather harmless. Sakura found herself motivating to become stronger because of Naruto, and she on the other hand helps Naruto mature and grow as a character along the way. At the end of the day they were teammates in Part 1 and Shippuden who both made each other better.\n\nBoruto: For any Boruto fans... Naruto and Sakura being together wouldn't change much of the plot in my opinion. Boruto doesn't harbor any hyuga abilities, and would get carried by karma regardless. How he gets his jougan isn't confirmed, but you could write in some alternative reasoning on him getting it besides bloodline. Sarada wouldn't change much either, especially personality wise where she has no reason to change. Although her \"super strength\" fighting style similar to Sakura's wouldn't be there, say her mom is Karin, the extra chakra from that bloodline makes her much more stronger in the show. And considering the power-scaling in Boruto, it definitely would make more sense.\n\nLet me know what you guys think though. Obviously not every MC and female lead need to be together, but in Naruto's case, especially with the pairings at the end of the series... most of them weren't really developed well.",
        "subreddit": "anime",
        "title": "Why Naruto and Sakura should be together.",
        "created": "Saturday, June 04, 2022 08:58:39",
        "removed_by_category": null,
        "Preprocessed post": "ultimately sakura and sasuke never really had any room to develop as a pairing for many reasonsone sided for anyone thats watched the show this is pretty clear and needs little explanation part 1 was sasuke and sakura with two polar opposite ambitions overall it was mostly sakura trying to get sasukes attention while sasuke would give her the cold shoulder shippuden was even worsesasuke going rogue by this point during the plot sakura hasnt seen sasuke in years while sasuke is meanwhile in ties with someone who plans on destroying the leaf theres not much reason why shes still harboring romantic feelings by this pointsasuke turning evil by this point its beyond reasoning how someone can attempt to kill someone twice make it clear he wants to destroy a village that harbors many friends and family of that said person only for the person to still love himno screentime overall with sasuke going rogue and on the other side there was simply no area where sakura and sasuke could have built chemistry for a grand majority of shippudenderailed sakuras character sakura spent half of her character development rationalizing her undying love for sasuke she started off well in shippuden working to make herself of aid to naruto but that quickly nosedived ever since the itachi pursuit arc overall many wierd and dumb decisions by her especially in the kage summit arc and even insanely was stuck on sasukes feelings while they were fighting madarain the case of naruto and sakura howevermore potential development the amount of screentime naruto and sakura shared throughout part 1 and shippuden was immense there was more than enough opportunites to squeeze some potential development especially for the first half in shippudenchemistry sakura had become a lot more caring towards naruto as part 1 came along its relatively clear the amount of care naruto has harbored towards sakura since the beggining of the series by shippuden the amount of care the two had for each other had became equal throughout the plot the two have had rather friendly back and forths that were rather harmless sakura found herself motivating to become stronger because of naruto and she on the other hand helps naruto mature and grow as a character along the way at the end of the day they were teammates in part 1 and shippuden who both made each other betterboruto for any boruto fans naruto and sakura being together wouldnt change much of the plot in my opinion boruto doesnt harbor any hyuga abilities and would get carried by karma regardless how he gets his jougan isnt confirmed but you could write in some alternative reasoning on him getting it besides bloodline sarada wouldnt change much either especially personality wise where she has no reason to change although her super strength fighting style similar to sakuras wouldnt be there say her mom is karin the extra chakra from that bloodline makes her much more stronger in the show and considering the powerscaling in boruto it definitely would make more senselet me know what you guys think though obviously not every mc and female lead need to be together but in narutos case especially with the pairings at the end of the series most of them werent really developed well"
    },
    {
        "author": "blueandgoldilocks",
        "created_utc": "Sunday, June 05, 2022 04:57:32",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xwxy/what_are_some_odd_ways_youve_discovered_anime/",
        "selftext": "For example, I discovered the Fate series in a very strange way \n\nMy friend made an AMV with a song by D-Technolife and I thought it was a pretty good song \n\nHowever, this was in the days before YouTube had every song under the sun, so I had to acquire it through...other methods \n\nI downloaded it and, for some reason, the person who uploaded the song chose to use the Fate 2006 promotional artwork as the cover art. And that's how I accidentally stumbled upon the Fate series",
        "subreddit": "anime",
        "title": "What are some odd ways you've discovered anime?",
        "created": "Saturday, June 04, 2022 08:57:32",
        "removed_by_category": null,
        "Preprocessed post": "for example i discovered the fate series in a very strange way my friend made an amv with a song by dtechnolife and i thought it was a pretty good song however this was in the days before youtube had every song under the sun so i had to acquire it throughother methods i downloaded it and for some reason the person who uploaded the song chose to use the fate 2006 promotional artwork as the cover art and thats how i accidentally stumbled upon the fate series"
    },
    {
        "author": "SorcererOfTheLake",
        "created_utc": "Sunday, June 05, 2022 04:57:29",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xww8/yuru_camp_rewatch_season_2_ovas_season_2_and/",
        "selftext": "##**Yuru Camp Rewatch**\n\n##**Season 2 OVAs / Season 2 and Series Discussion**\n\nDatabase/Streaming Links: [MAL](https://myanimelist.net/anime/34798/Yuru_Camp%E2%96%B3) / [Crunchyroll](https://myanimelist.net/anime/34798/Yuru_Camp%E2%96%B3) / [VRV](https://vrv.co/series/GRWEW95KR)\n\n[Original Interest Thread](https://old.reddit.com/r/anime/comments/tvbn67/yuru_camp_rewatch_interest_thread/?) / [Announcement Thread](https://old.reddit.com/r/anime/comments/tw5l2n/yuru_camp_rewatch_announcement_and_schedule/?) / [Discord Server Link](https://discord.gg/HsBREWUbPE)\n\nQuestions of the Series: \n\nSeason 2 Questions: \n\n* Favorite episode?    \n* Favorite moment?    \n* Favorite campsite?    \n* OP or ED?\n\nOverall Series Questions: \n\n* Favorite episode?    \n* Favorite moment?    \n* Favorite character?    \n* Favorite vocal performance?    \n* Favorite campsite?    \n* Season 1 or 2?    \n* Favorite OP?    \n* Favorite ED?    \n* What would you like to see in the movie/a possible Season 3?    \n* For rewatchers: Has your opinion of *Yuru Camp* changed after this rewatch?    \n* For first-time watchers: What expectations did you have coming into this series? Were you surprised in any way?\n\nComment of the Day: The COTD for yesterday’s thread goes to /u/TiredTiroth for having another [damn fine post](https://old.reddit.com/r/anime/comments/v48t2q/yuru_camp_rewatch_season_2_episode_13_discussion/ib2zcsu/).\n\nCommenter of the Rewatch: For those paying attention, we have a lot of smart and interesting commenters throughout the rewatch, but with 9 COTDs, the clear king was /u/Barbed_Dildo for their informative, insightful, and clearly relayed commentary. Well down, my camper.\n\n[&lt;- Previous Episode](https://old.reddit.com/r/anime/comments/v48t2q/yuru_camp_rewatch_season_2_episode_13_discussion/?) | [Rewatch Schedule](https://old.reddit.com/r/anime/comments/tw5l2n/yuru_camp_rewatch_announcement_and_schedule/?) | [Have a Nice Day! -&gt;](https://www.youtube.com/watch?v=zs_kXpVJd00)\n:--|:--:|--:",
        "subreddit": "anime",
        "title": "Yuru Camp Rewatch - Season 2 OVAs / Season 2 and Series Discussion [FINAL THREAD]",
        "created": "Saturday, June 04, 2022 08:57:29",
        "removed_by_category": null,
        "Preprocessed post": "yuru camp rewatchseason 2 ovas  season 2 and series discussiondatabasestreaming links mal isURL  crunchyroll isURL  vrv isURLoriginal interest thread isURL  announcement thread isURL  discord server link isURLquestions of the series season 2 questions  favorite episode     favorite moment     favorite campsite     op or edoverall series questions  favorite episode     favorite moment     favorite character     favorite vocal performance     favorite campsite     season 1 or 2     favorite op     favorite ed     what would you like to see in the moviea possible season 3     for rewatchers has your opinion of yuru camp changed after this rewatch     for firsttime watchers what expectations did you have coming into this series were you surprised in any waycomment of the day the cotd for yesterdays thread goes to utiredtiroth for having another damn fine post isURLcommenter of the rewatch for those paying attention we have a lot of smart and interesting commenters throughout the rewatch but with 9 cotds the clear king was ubarbed_dildo for their informative insightful and clearly relayed commentary well down my camperlt previous episode isURL  rewatch schedule isURL  have a nice day gt isURL"
    },
    {
        "author": "No-Revolution-9773",
        "created_utc": "Sunday, June 05, 2022 04:56:17",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xw37/i_watched_fate_zero_before_ive_seen_fate/",
        "selftext": "I watched fate zero before I’ve seen fate stay/night. Did I mess up? I got confused on the order and thought that was the first one but later I found out it’s the second one?",
        "subreddit": "anime",
        "title": "I watched fate zero before I’ve seen fate stay/night. Did I mess up?",
        "created": "Saturday, June 04, 2022 08:56:17",
        "removed_by_category": null,
        "Preprocessed post": "i watched fate zero before ive seen fate staynight did i mess up i got confused on the order and thought that was the first one but later i found out its the second one"
    },
    {
        "author": "emuxit",
        "created_utc": "Sunday, June 05, 2022 04:40:05",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xktl/komi_san_animation_quality/",
        "selftext": "i read the komi san manga and i loved every bit of it. I especially found the art style incredibly cute, and it was simple enough where it wasnt overbearingly dramatic. It was detailed cuteness.\n\nI watched the first episode of the anime and i found it.. fine. I was hesistant to keep watching but i feel like a lot of it didnt work for me. I dont want to sound like a piece of shit, i know animation is hard and covid has impacted the production of it but i feel like i havent heard this opinion a lot. So i need to know if I'm being ridiculous or not. \n\nIt would be lots of little things like weird proportions on characters, weird angles of shadows on certain characters.. idk. Please let me know if I'm really just being nitpicky.",
        "subreddit": "anime",
        "title": "komi san animation quality",
        "created": "Saturday, June 04, 2022 08:40:05",
        "removed_by_category": null,
        "Preprocessed post": "i read the komi san manga and i loved every bit of it i especially found the art style incredibly cute and it was simple enough where it wasnt overbearingly dramatic it was detailed cutenessi watched the first episode of the anime and i found it fine i was hesistant to keep watching but i feel like a lot of it didnt work for me i dont want to sound like a piece of shit i know animation is hard and covid has impacted the production of it but i feel like i havent heard this opinion a lot so i need to know if im being ridiculous or not it would be lots of little things like weird proportions on characters weird angles of shadows on certain characters idk please let me know if im really just being nitpicky"
    },
    {
        "author": "Pitiful_Witness6236",
        "created_utc": "Sunday, June 05, 2022 04:35:00",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xhd8/i_have_a_problemshippuden_spoilers/",
        "selftext": "\n\n*Shippuden Spoilers*\nI’m new to anime. I’ve been watching naruto and finished the original series (-fillers) and loved it. However because of shippudens popularity and my asshole friends I have had many many things spoiled for me about the show such as Jiyaras Itatchi and Nejis death and Naruto becoming 7th Hokage. I have many animes that I would like to start watching such as AOT HxH SpyXFamily etc…. So my question is do you think I should pause watching shippuden as I am only 30 episodes in and watch different animes in the hope that I will forget some spoilers or to keep watching shippuden. Any advice would be appreciated. :)",
        "subreddit": "anime",
        "title": "I have a problem(Shippuden Spoilers)",
        "created": "Saturday, June 04, 2022 08:35:00",
        "removed_by_category": null,
        "Preprocessed post": "shippuden spoilersim new to anime ive been watching naruto and finished the original series fillers and loved it however because of shippudens popularity and my asshole friends i have had many many things spoiled for me about the show such as jiyaras itatchi and nejis death and naruto becoming 7th hokage i have many animes that i would like to start watching such as aot hxh spyxfamily etc so my question is do you think i should pause watching shippuden as i am only 30 episodes in and watch different animes in the hope that i will forget some spoilers or to keep watching shippuden any advice would be appreciated "
    },
    {
        "author": "fatedestroyer69",
        "created_utc": "Sunday, June 05, 2022 04:30:59",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xeli/why_tf_so_many_stupid_dumb_assnaivelack_of_common/",
        "selftext": "Dude seriously we have to talk about this shit, the way they putting mc that so dumb &amp; naive beyond my understanding, yea i know sometimes mc is naive \n\nbut In ANIME there's so many thing that really really pointless we should bomb 1 star review on my animelist \n\nthe way they making mc beyond dumb and naive Is BECAUSE THEY DON'T REALLY CARE ABOUT A STORY,\n\n\n \" HEY! I WANT THIS COUPLE TO BREAK UP, I JUST PUT UNREASONABLE REASON TO BREAK THEM UP\",\n\n\n\n, \" I WANT TOP PUT THE MC TO BE STRONG, I JUST HAVE TO MAKE MC THAT SO DUMB AND GOT EASILY BETRAYED\"\n\nIDK LAH YA! BUT I FREAKING BOILED MY BLOOD BECAUSE THERE'S SO MANY GARBAGE ANIME WHILE IT'S SO FREAKING HARD TO FIND MASTERPIECE ANIME, BUT I DON'T REALLY NEED MASTERPIECE ALL I NEED WAS ENJOYABLE ANIME NOT A STUPID MF SUCH A NAIVE ANIME\n\n\nSORRY I JUST WANNA RANT",
        "subreddit": "anime",
        "title": "WHY TF SO MANY STUPID, DUMB ASS,NAIVE,LACK OF COMMON SENSE MAIN CHARECTER IN ANIME?",
        "created": "Saturday, June 04, 2022 08:30:59",
        "removed_by_category": null,
        "Preprocessed post": "dude seriously we have to talk about this shit the way they putting mc that so dumb amp naive beyond my understanding yea i know sometimes mc is naive but in anime theres so many thing that really really pointless we should bomb 1 star review on my animelist the way they making mc beyond dumb and naive is because they dont really care about a story  hey i want this couple to break up i just put unreasonable reason to break them up  i want top put the mc to be strong i just have to make mc that so dumb and got easily betrayedidk lah ya but i freaking boiled my blood because theres so many garbage anime while its so freaking hard to find masterpiece anime but i dont really need masterpiece all i need was enjoyable anime not a stupid mf such a naive animesorry i just wanna rant"
    },
    {
        "author": "Pitiful_Witness6236",
        "created_utc": "Sunday, June 05, 2022 04:25:25",
        "full_link": "https://www.reddit.com/r/anime/comments/v4xary/i_have_a_small_problem/",
        "selftext": "*Shippuden Spoilers*\nI’m new to anime. I’ve been watching naruto and finished the original series (-fillers) and loved it. However because of shippudens popularity and my asshole friends I have had many many things spoiled for me about the show such as Jiyaras Itatchi and Nejis death and Naruto becoming 7th Hokage. I have many animes that I would like to start watching such as AOT HxH SpyXFamily etc…. So my question is do you think I should pause watching shippuden as I am only 30 episodes in and watch different animes in the hope that I will forget some spoilers or to keep watching shippuden. Any advice would be appreciated. :)",
        "subreddit": "anime",
        "title": "I have a small problem",
        "created": "Saturday, June 04, 2022 08:25:25",
        "removed_by_category": null,
        "Preprocessed post": "shippuden spoilersim new to anime ive been watching naruto and finished the original series fillers and loved it however because of shippudens popularity and my asshole friends i have had many many things spoiled for me about the show such as jiyaras itatchi and nejis death and naruto becoming 7th hokage i have many animes that i would like to start watching such as aot hxh spyxfamily etc so my question is do you think i should pause watching shippuden as i am only 30 episodes in and watch different animes in the hope that i will forget some spoilers or to keep watching shippuden any advice would be appreciated "
    },
    {
        "author": "Senior_Wrongdoer",
        "created_utc": "Sunday, June 05, 2022 04:17:54",
        "full_link": "https://www.reddit.com/r/anime/comments/v4x5p9/weakest_anime_character_that_could_beat/",
        "selftext": "yeah I know this might seem stupid but i just sorta wondered about this, and yes, i know that ash-Greninja isn't all that strong compared to other animes (Alain's Mega Charizard X beat him with a type disadvantage) but anyways, I'm just doing it for the lulz",
        "subreddit": "anime",
        "title": "Weakest Anime character that could beat Ash-Greninja?",
        "created": "Saturday, June 04, 2022 08:17:54",
        "removed_by_category": null,
        "Preprocessed post": "yeah i know this might seem stupid but i just sorta wondered about this and yes i know that ashgreninja isnt all that strong compared to other animes alains mega charizard x beat him with a type disadvantage but anyways im just doing it for the lulz"
    },
    {
        "author": "Zorary",
        "created_utc": "Sunday, June 05, 2022 04:16:08",
        "full_link": "https://www.reddit.com/r/anime/comments/v4x4ii/in_honor_of_pride_month_recommend_me_some_anime/",
        "selftext": "So I'm searching for anime with lgbtq+ characters, not BL or GL (I'm open to those too) bit more like paradise kiss or Blue period with good representation without making it the whole character's personality",
        "subreddit": "anime",
        "title": "in honor of Pride month recommend me some anime with lgbtq representation",
        "created": "Saturday, June 04, 2022 08:16:08",
        "removed_by_category": null,
        "Preprocessed post": "so im searching for anime with lgbtq characters not bl or gl im open to those too bit more like paradise kiss or blue period with good representation without making it the whole characters personality"
    },
    {
        "author": "IZARK-7740",
        "created_utc": "Sunday, June 05, 2022 04:12:12",
        "full_link": "https://www.reddit.com/r/anime/comments/v4x1rt/no_game_no_life_season_2_discussion/",
        "selftext": "Anything you can say about season 2 or what you think it might be about. (If it comes out)",
        "subreddit": "anime",
        "title": "No Game No Life season 2 Discussion.",
        "created": "Saturday, June 04, 2022 08:12:12",
        "removed_by_category": null,
        "Preprocessed post": "anything you can say about season 2 or what you think it might be about if it comes out"
    },
    {
        "author": "IZARK-7740",
        "created_utc": "Sunday, June 05, 2022 04:09:52",
        "full_link": "https://www.reddit.com/r/anime/comments/v4x047/no_game_no_life_season_2_disscution/",
        "selftext": "What would you like to see in it. When do you think it might come out. What do you think the plot line for it might be. ect.",
        "subreddit": "anime",
        "title": "No Game No Life season 2? Disscution",
        "created": "Saturday, June 04, 2022 08:09:52",
        "removed_by_category": null,
        "Preprocessed post": "what would you like to see in it when do you think it might come out what do you think the plot line for it might be ect"
    },
    {
        "author": "No_Cake_2126",
        "created_utc": "Sunday, June 05, 2022 03:59:38",
        "full_link": "https://www.reddit.com/r/anime/comments/v4wsp3/where_should_i_watch_steins_gate/",
        "selftext": "I wanted to watch steins Gate in the English dub as it has some of my favourite vas in it but i couldn't understand what they were saying sometimes as English is not my first language. So, is there any place were I can watch the English dub of steins Gate with subtitles, I know I can just watch it on crunchyroll but I can't buy the subscription as I am not old enough.",
        "subreddit": "anime",
        "title": "where should I watch steins Gate",
        "created": "Saturday, June 04, 2022 07:59:38",
        "removed_by_category": null,
        "Preprocessed post": "i wanted to watch steins gate in the english dub as it has some of my favourite vas in it but i couldnt understand what they were saying sometimes as english is not my first language so is there any place were i can watch the english dub of steins gate with subtitles i know i can just watch it on crunchyroll but i cant buy the subscription as i am not old enough"
    },
    {
        "author": "Timeforamunch",
        "created_utc": "Sunday, June 05, 2022 03:58:31",
        "full_link": "https://www.reddit.com/r/anime/comments/v4wrzk/hey_guys_lil_help_here/",
        "selftext": "hello! I am bored. very bored. need something to watch asap. Would love an isekai, mabye slightly less known as i have watched lots of the main ones, favourite type of anime is magic medieval isekai, anyone know of any good ones? need as many as possible thanks!",
        "subreddit": "anime",
        "title": "Hey guys, lil help here?",
        "created": "Saturday, June 04, 2022 07:58:31",
        "removed_by_category": null,
        "Preprocessed post": "hello i am bored very bored need something to watch asap would love an isekai mabye slightly less known as i have watched lots of the main ones favourite type of anime is magic medieval isekai anyone know of any good ones need as many as possible thanks"
    },
    {
        "author": "No_Cake_2126",
        "created_utc": "Sunday, June 05, 2022 03:55:54",
        "full_link": "https://www.reddit.com/r/anime/comments/v4wq8m/daily_life_of_highschool_boys_sub_or_dub/",
        "selftext": "Hey i was planning on watching daily life of highschool boys but was just wondering if I should watch it in dub or sub. I usually prefer the dub for comedy animes coz i think they are more funny but there are bad dubs as well such as nichjou. So, should I watch it in dub or sub",
        "subreddit": "anime",
        "title": "daily life of highschool boys: sub or dub",
        "created": "Saturday, June 04, 2022 07:55:54",
        "removed_by_category": null,
        "Preprocessed post": "hey i was planning on watching daily life of highschool boys but was just wondering if i should watch it in dub or sub i usually prefer the dub for comedy animes coz i think they are more funny but there are bad dubs as well such as nichjou so should i watch it in dub or sub"
    },
    {
        "author": "Sidthuglife",
        "created_utc": "Sunday, June 05, 2022 03:46:42",
        "full_link": "https://www.reddit.com/r/anime/comments/v4wjrc/just_a_question_for_girls/",
        "selftext": "Um like, in the anime realm wut is the difference b/w ass and hips.??",
        "subreddit": "anime",
        "title": "just a question for girls",
        "created": "Saturday, June 04, 2022 07:46:42",
        "removed_by_category": null,
        "Preprocessed post": "um like in the anime realm wut is the difference bw ass and hips"
    },
    {
        "author": "3sperr",
        "created_utc": "Sunday, June 05, 2022 02:54:30",
        "full_link": "https://www.reddit.com/r/anime/comments/v4vcnu/my_standards_for_animation_is_too_highhow_do_i/",
        "selftext": "Its like I treat episode 1017 of one piece like a normal episode, but to everyone else the animation was damn good and people even got chills. How do I fix this",
        "subreddit": "anime",
        "title": "My standards for animation is too high...how do i fix this?",
        "created": "Saturday, June 04, 2022 06:54:30",
        "removed_by_category": null,
        "Preprocessed post": "its like i treat episode 1017 of one piece like a normal episode but to everyone else the animation was damn good and people even got chills how do i fix this"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Sunday, June 05, 2022 02:36:31",
        "full_link": "https://www.reddit.com/r/anime/comments/v4uzs0/kingdom_season_4_episode_9_discussion/",
        "selftext": "*Kingdom Season 4*, episode 9: Zi Bai's Name\n\nAlternative names: *Kingdom Season 4*\n\n# [Rate this episode here.](https://youpoll.me/79061/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/kingdom)\n* [Funimation](https://www.funimation.com/shows/kingdom/)\n* [Wakanim](https://www.wakanim.tv/sc/v2/catalogue/show/1360)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/50160/)\n* [AniList](https://anilist.co/anime/140350)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16912)\n* [Kitsu](https://kitsu.io/anime/45324)\n* [Anime-Planet](https://www.anime-planet.com/anime/kingdom-4)\n* [Official Website](https://kingdom-anime.com/)\n* **/r/Kingdom**\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/u02776)|[4.75](https://youpoll.me/75033/r)\n2|[Link](https://redd.it/u544hw)|[4.72](https://youpoll.me/75368/r)\n3|[Link](https://redd.it/uabs1k)|[4.84](https://youpoll.me/75748/r)\n4|[Link](https://redd.it/ufh1mk)|[4.84](https://youpoll.me/76265/r)\n5|[Link](https://redd.it/ukjds2)|[4.87](https://youpoll.me/76758/r)\n6|[Link](https://redd.it/upnfpk)|[4.8](https://youpoll.me/77250/r)\n7|[Link](https://redd.it/uut3ab)|[4.64](https://youpoll.me/77740/r)\n8|[Link](https://redd.it/uztaj5)|[4.86](https://youpoll.me/78397/r)\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Kingdom Season 4 - Episode 9 discussion",
        "created": "Saturday, June 04, 2022 06:36:31",
        "removed_by_category": null,
        "Preprocessed post": "kingdom season 4 episode 9 zi bais namealternative names kingdom season 4 rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURL funimation isURL wakanim isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURL rkingdomall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "Ok_Rip997",
        "created_utc": "Sunday, June 05, 2022 02:19:08",
        "full_link": "https://www.reddit.com/r/anime/comments/v4un8v/is_bento_and_yozakura_quest_worth_watching/",
        "selftext": "Which one of these did yall enjoy i wanna see something",
        "subreddit": "anime",
        "title": "is Ben-to and yozakura quest worth watching",
        "created": "Saturday, June 04, 2022 06:19:08",
        "removed_by_category": null,
        "Preprocessed post": "which one of these did yall enjoy i wanna see something"
    },
    {
        "author": "Any-Peanut6470",
        "created_utc": "Sunday, June 05, 2022 02:17:57",
        "full_link": "https://www.reddit.com/r/anime/comments/v4umg3/is_bento_and_yozakura_quest_worth_watching/",
        "selftext": "These are the last 2 anime on my friends list they seem interesting did yll enjoy it",
        "subreddit": "anime",
        "title": "is Ben-to and yozakura quest worth watching",
        "created": "Saturday, June 04, 2022 06:17:57",
        "removed_by_category": null,
        "Preprocessed post": "these are the last 2 anime on my friends list they seem interesting did yll enjoy it"
    },
    {
        "author": "Humble_Award_4873",
        "created_utc": "Sunday, June 05, 2022 02:17:20",
        "full_link": "https://www.reddit.com/r/anime/comments/v4um01/what_do_you_think_is_going_to_be_the_mustwatch/",
        "selftext": "Winter had attack on titan and demon slayer. spring has spy x family and kaguya-sama. What is going to be the must-watch of summer?",
        "subreddit": "anime",
        "title": "What do you think is going to be the must-watch anime of summer 2022",
        "created": "Saturday, June 04, 2022 06:17:20",
        "removed_by_category": null,
        "Preprocessed post": "winter had attack on titan and demon slayer spring has spy x family and kaguyasama what is going to be the mustwatch of summer"
    },
    {
        "author": "Street_Result_8164",
        "created_utc": "Sunday, June 05, 2022 02:14:41",
        "full_link": "https://www.reddit.com/r/anime/comments/v4uk34/help_me_find_an_anime/",
        "selftext": "It’s an anime I watched a while ago and I’m just kinda feeling like watching it, but for the life of me I can’t remember it’s name. It takes place in a high school and I think the first episode goes something like the main character goes to give her crush a gift she made for him but he just says “I don’t want it.” When she goes to her dad, her home is kinda old. Theres an earthquake and her home falls down, it’s the only house to fall down. Her dad says they’re going to live with one of his friends and his friend they’re living with us her crush’s family she was just rejected by. At least I think that’s how the episode goes, I’m not entirely sure",
        "subreddit": "anime",
        "title": "Help me find an anime",
        "created": "Saturday, June 04, 2022 06:14:41",
        "removed_by_category": null,
        "Preprocessed post": "its an anime i watched a while ago and im just kinda feeling like watching it but for the life of me i cant remember its name it takes place in a high school and i think the first episode goes something like the main character goes to give her crush a gift she made for him but he just says i dont want it when she goes to her dad her home is kinda old theres an earthquake and her home falls down its the only house to fall down her dad says theyre going to live with one of his friends and his friend theyre living with us her crushs family she was just rejected by at least i think thats how the episode goes im not entirely sure"
    },
    {
        "author": "Ok-Dingo-3684",
        "created_utc": "Sunday, June 05, 2022 02:01:12",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ua5x/from_which_chapter_should_i_continue_the_spy_x/",
        "selftext": "the title says it all",
        "subreddit": "anime",
        "title": "from which chapter should i continue the spy x family manga after completing episode 9?",
        "created": "Saturday, June 04, 2022 06:01:12",
        "removed_by_category": null,
        "Preprocessed post": "the title says it all"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Sunday, June 05, 2022 02:00:37",
        "full_link": "https://www.reddit.com/r/anime/comments/v4u9q3/kakkou_no_iinazuke_episode_7_discussion/",
        "selftext": "*Kakkou no Iinazuke*, episode 7: Untitled\n\nAlternative names: *A Couple of Cuckoos*\n\n# [Rate this episode here.](https://youpoll.me/79057/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/a-couple-of-cuckoos)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/48675/)\n* [AniList](https://anilist.co/anime/132052)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16188)\n* [Kitsu](https://kitsu.io/anime/44310)\n* [Anime-Planet](https://www.anime-planet.com/anime/a-couple-of-cuckoos)\n* [Official Website](https://cuckoos-anime.com/)\n* **/r/Cuckoo**\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/ua9c16)|[3.94](https://youpoll.me/75741/r)\n2|[Link](https://redd.it/ufeqfm)|[4.14](https://youpoll.me/76257/r)\n3|[Link](https://redd.it/ukh18a)|[4.31](https://youpoll.me/76753/r)\n4|[Link](https://redd.it/upl0za)|[4.39](https://youpoll.me/77239/r)\n5|[Link](https://redd.it/uusjrf)|[4.12](https://youpoll.me/77738/r)\n6|[Link](https://redd.it/uzsqmi)|[4.31](https://youpoll.me/78394/r)\n\n\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Kakkou no Iinazuke - Episode 7 discussion",
        "created": "Saturday, June 04, 2022 06:00:37",
        "removed_by_category": null,
        "Preprocessed post": "kakkou no iinazuke episode 7 untitledalternative names a couple of cuckoos rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURL rcuckooall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "AccomplishedEssay504",
        "created_utc": "Sunday, June 05, 2022 01:54:01",
        "full_link": "https://www.reddit.com/r/anime/comments/v4u4pv/im_currently_watching_clannad_after_story_in_what/",
        "selftext": "I'm watching Clannad After Story and I'm currently at Sunohara arc. I was told that things will get sadder in this season in comparison to Clannad. Just a quick question, in what episode/s will it be almost impossible to hold back tears? Just want to ask so I can prepare myself and so I can watch it/them when no one sees me. Don't want everyone in our house to see me bawling my eyes out lol. And please keep it spoiler-free. Thank you!",
        "subreddit": "anime",
        "title": "I'm currently watching Clannad After Story, in what part will it get sad?",
        "created": "Saturday, June 04, 2022 05:54:01",
        "removed_by_category": null,
        "Preprocessed post": "im watching clannad after story and im currently at sunohara arc i was told that things will get sadder in this season in comparison to clannad just a quick question in what episodes will it be almost impossible to hold back tears just want to ask so i can prepare myself and so i can watch itthem when no one sees me dont want everyone in our house to see me bawling my eyes out lol and please keep it spoilerfree thank you"
    },
    {
        "author": "No-Consequence-6092",
        "created_utc": "Sunday, June 05, 2022 01:52:45",
        "full_link": "https://www.reddit.com/r/anime/comments/v4u3ue/does_anyone_else_here_find_watching_anime_to_be/",
        "selftext": "I've been watching anime intermittently for a few years now and I've noticed something about myself.\n\nI find watching many episodes of anime to be very tiring. At most I can watch 3 episodes in a sitting. It is not an activity I can do to unwind after a day's work.\n\nIt may be due to an increased concentration necessary to pick everything up. It might be just due to not finding the right shows.\n\nAs of now, finding a show that isn't tiring to watch, or doesn't feel like work is what classifies something as good to me.\n\nDoes anyone else feel the same sometimes? Does anyone else get zapped after watching a few episodes or is it just me?",
        "subreddit": "anime",
        "title": "Does anyone else here find watching anime to be tiring sometimes?",
        "created": "Saturday, June 04, 2022 05:52:45",
        "removed_by_category": null,
        "Preprocessed post": "ive been watching anime intermittently for a few years now and ive noticed something about myselfi find watching many episodes of anime to be very tiring at most i can watch 3 episodes in a sitting it is not an activity i can do to unwind after a days workit may be due to an increased concentration necessary to pick everything up it might be just due to not finding the right showsas of now finding a show that isnt tiring to watch or doesnt feel like work is what classifies something as good to medoes anyone else feel the same sometimes does anyone else get zapped after watching a few episodes or is it just me"
    },
    {
        "author": "UrgotRave",
        "created_utc": "Sunday, June 05, 2022 01:41:30",
        "full_link": "https://www.reddit.com/r/anime/comments/v4tvw4/my_personal_favorite_anime_you_can_comment_yours/",
        "selftext": "Akira, Ghost in the Shell, Mononoke, Texhnolyze, Serial Experiments Lain, Monster, Wolf's Rain, Amanchu!, Perfect Blue",
        "subreddit": "anime",
        "title": "My personal favorite anime (you can comment yours too)",
        "created": "Saturday, June 04, 2022 05:41:30",
        "removed_by_category": null,
        "Preprocessed post": "akira ghost in the shell mononoke texhnolyze serial experiments lain monster wolfs rain amanchu perfect blue"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Sunday, June 05, 2022 01:32:27",
        "full_link": "https://www.reddit.com/r/anime/comments/v4tphe/kawaii_dake_ja_nai_shikimorisan_episode_8/",
        "selftext": "*Kawaii dake ja Nai Shikimori-san*, episode 8\n\nAlternative names: *Shikimori's Not Just a Cutie*\n\n# [Rate this episode here.](https://youpoll.me/79054/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/shikimoris-not-just-a-cutie)\n* [Muse Asia](https://www.youtube.com/playlist?list=PLwLSw1_eDZl2v3GdglUbai_QNMJHZMOHP)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/45613/)\n* [AniList](https://anilist.co/anime/127911)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=15964)\n* [Kitsu](https://kitsu.io/anime/44159)\n* [Anime-Planet](https://www.anime-planet.com/anime/shikimoris-not-just-a-cutie)\n* [Official Website](https://shikimori-anime.com/)\n* **/r/ShikimoriIsntJustCute**\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tzy5o2)|[3.76](https://youpoll.me/75024/r)\n2|[Link](https://redd.it/u52sfj)|[3.58](https://youpoll.me/75363/r)\n3|[Link](https://redd.it/uaahtn)|[3.72](https://youpoll.me/75746/r)\n4|[Link](https://redd.it/uffyuu)|[3.95](https://youpoll.me/76262/r)\n5|[Link](https://redd.it/uki9x3)|[4.23](https://youpoll.me/76755/r)\n6|[Link](https://redd.it/upm6rg)|[4.36](https://youpoll.me/77243/r)\n7|[Link](https://redd.it/uzs7c5)|[4.46](https://youpoll.me/78392/r)\n\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Kawaii dake ja Nai Shikimori-san - Episode 8 discussion",
        "created": "Saturday, June 04, 2022 05:32:27",
        "removed_by_category": null,
        "Preprocessed post": "kawaii dake ja nai shikimorisan episode 8alternative names shikimoris not just a cutie rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURL muse asia isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURL rshikimoriisntjustcuteall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "LLancee",
        "created_utc": "Sunday, June 05, 2022 01:28:46",
        "full_link": "https://www.reddit.com/r/anime/comments/v4tmsw/am_i_right_or_wrong_its_up_to_you/",
        "selftext": "Unpopular opinions cuz why not\n\nTitle says all I think. If you disagree, that’s fine, everyone’s entitled to their own opinion, but if you would like to tell me why you may disagree, please tell me in the comments. Anyway here they are:\n\n1. Rei&gt;Asuka \n\n2. Cowboy Bebop has the best dub of any anime ever\n\n3. Re:Zero season 1 is overhyped \n\n4. No game no life has a better artstyle than Violet Evergarden\n\n5. Yuri on ice would’ve still gotten stale even if they actually kept up the artstyle \n\n6. Kirito is worse than Shinji Ikari\n\n7. Kiyama hiroto is the best striker in Inazuma national\n\n8. Berserk was never good\n\n9. Tokyo Ghouls plot never made sense\n\n10. Bakugo is the worst character in the entire My Hero Academia series\n\n\n\nSo, those were my takes. What are we thinking?",
        "subreddit": "anime",
        "title": "Am I right or wrong? It’s up to you…",
        "created": "Saturday, June 04, 2022 05:28:46",
        "removed_by_category": null,
        "Preprocessed post": "unpopular opinions cuz why nottitle says all i think if you disagree thats fine everyones entitled to their own opinion but if you would like to tell me why you may disagree please tell me in the comments anyway here they are1 reigtasuka 2 cowboy bebop has the best dub of any anime ever3 rezero season 1 is overhyped 4 no game no life has a better artstyle than violet evergarden5 yuri on ice wouldve still gotten stale even if they actually kept up the artstyle 6 kirito is worse than shinji ikari7 kiyama hiroto is the best striker in inazuma national8 berserk was never good9 tokyo ghouls plot never made sense10 bakugo is the worst character in the entire my hero academia seriesso those were my takes what are we thinking"
    },
    {
        "author": "AccomplishedFigure11",
        "created_utc": "Sunday, June 05, 2022 01:23:26",
        "full_link": "https://www.reddit.com/r/anime/comments/v4tj59/any_anime_similar_to_attack_on_titan/",
        "selftext": "One of the things I love most about this show is that it feels like there's hardly ever any filler.  Like every episode or scene even makes the most of it's time and portrays moments either directly tied to or relevant to the overall plot.  They don't waste the viewers' time.\n\nIs there any other anime like this?  It's a little difficult to Google that particular trait so I wasn't sure how to find another show like that without direct recommendations.\n\nI don't mind if the genre is completely different from AoT.  As long as it's a show that makes the most of it's runtime.  I love it when I'm able to enjoy every episode even the ones some people consider slow or boring.",
        "subreddit": "anime",
        "title": "Any anime similar to Attack On Titan?",
        "created": "Saturday, June 04, 2022 05:23:26",
        "removed_by_category": null,
        "Preprocessed post": "one of the things i love most about this show is that it feels like theres hardly ever any filler  like every episode or scene even makes the most of its time and portrays moments either directly tied to or relevant to the overall plot  they dont waste the viewers timeis there any other anime like this  its a little difficult to google that particular trait so i wasnt sure how to find another show like that without direct recommendationsi dont mind if the genre is completely different from aot  as long as its a show that makes the most of its runtime  i love it when im able to enjoy every episode even the ones some people consider slow or boring"
    },
    {
        "author": "Hellstorm5674",
        "created_utc": "Sunday, June 05, 2022 01:18:37",
        "full_link": "https://www.reddit.com/r/anime/comments/v4tfn5/my_folks_said_anime_is_for_kids_me_22_disagrees/",
        "selftext": "I mean I wear anime clothing and like otaku culture. My folks say the girls aren't attracted to that, yet I see otaku couples out in public. WTF am I doing wrong lol..... but is anime really for kids, or can adults like me enjoy it too?",
        "subreddit": "anime",
        "title": "My folks said anime is for kids. Me (22), disagrees.",
        "created": "Saturday, June 04, 2022 05:18:37",
        "removed_by_category": null,
        "Preprocessed post": "i mean i wear anime clothing and like otaku culture my folks say the girls arent attracted to that yet i see otaku couples out in public wtf am i doing wrong lol but is anime really for kids or can adults like me enjoy it too"
    },
    {
        "author": "Secure_Repair9787",
        "created_utc": "Sunday, June 05, 2022 01:07:18",
        "full_link": "https://www.reddit.com/r/anime/comments/v4t7if/ive_found_out_how_old_is_aqua_from_kono/",
        "selftext": "So apparently in the light novel when Sato Kazuma and Aqua were looking for \"Railgun\" Kazuma asked Aqua about how old is she, she answered that 1 hour in heavens is equal to 1 month on Earth. First time Kazuma and Aqua met he said that she is looking like she is the same age as Kazuma himself. So if we turn 17 years to hours we will get 148920, that means that Aqua was living for 148920 months in Earth time which is equal to approximately 12418 years.",
        "subreddit": "anime",
        "title": "I've found out how old is Aqua from \"Kono Subarashii Sekai ni Shukufuku wo!\"",
        "created": "Saturday, June 04, 2022 05:07:18",
        "removed_by_category": null,
        "Preprocessed post": "so apparently in the light novel when sato kazuma and aqua were looking for railgun kazuma asked aqua about how old is she she answered that 1 hour in heavens is equal to 1 month on earth first time kazuma and aqua met he said that she is looking like she is the same age as kazuma himself so if we turn 17 years to hours we will get 148920 that means that aqua was living for 148920 months in earth time which is equal to approximately 12418 years"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Sunday, June 05, 2022 01:03:00",
        "full_link": "https://www.reddit.com/r/anime/comments/v4t4en/build_divide_ffffff_code_white_episode_9/",
        "selftext": "*Build Divide: #FFFFFF Code White*, episode 9 (21): Live in the Now, Now, Now!\n\nAlternative names: *Build Divide: #000000 Code Black Season 2*\n\n# [Rate this episode here.](https://youpoll.me/79053/)\n\n\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/build-divide-000000-code-black)\n* [Funimation](https://www.funimation.com/shows/build-divide-000000-code-black/)\n* [VRV](https://vrv.co/series/GG5H5XDE1)\n* [Wakanim](https://www.wakanim.tv/sc/v2/catalogue/show/1553/build-divide-000000-code-black)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/48777/)\n* [AniList](https://anilist.co/anime/132526)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16266)\n* [Kitsu](https://kitsu.io/anime/44426)\n* [Anime-Planet](https://www.anime-planet.com/anime/build-divide-2)\n* [Official Website](https://anime.build-divide.com/)\n* **/r/BuildDivideTCG**\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tunoa5)|[4.0](https://youpoll.me/74668/r)\n2|[Link](https://redd.it/tzxjx3)|[4.86](https://youpoll.me/75021/r)\n3|[Link](https://redd.it/ub4hop)|[5.0](https://youpoll.me/75845/r)\n4|[Link](https://redd.it/ub4hw0)|[----](https://youpoll.me/75846/r)\n5|[Link](https://redd.it/uff9gk)|[5.0](https://youpoll.me/76258/r)\n6|[Link](https://redd.it/upllfi)|[5.0](https://youpoll.me/77241/r)\n7|[Link](https://redd.it/uura8a)|[----](https://youpoll.me/77734/r)\n8|[Link](https://redd.it/uzrlxy)|[5.0](https://youpoll.me/78389/r)\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Build Divide: #FFFFFF Code White - Episode 9 discussion",
        "created": "Saturday, June 04, 2022 05:03:00",
        "removed_by_category": null,
        "Preprocessed post": "build divide ffffff code white episode 9 21 live in the now now nowalternative names build divide 000000 code black season 2 rate this episode here isURLstreams crunchyroll isURL funimation isURL vrv isURL wakanim isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURL rbuilddividetcgall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "Lexouch",
        "created_utc": "Sunday, June 05, 2022 12:49:35",
        "full_link": "https://www.reddit.com/r/anime/comments/v4suet/is_gurren_laggan_overated/",
        "selftext": "People say its the best anime of all time but personally I didn't like it and don't understand what made people love it sm. What are you guys' thoughts?",
        "subreddit": "anime",
        "title": "is gurren Laggan overated?",
        "created": "Saturday, June 04, 2022 04:49:35",
        "removed_by_category": null,
        "Preprocessed post": "people say its the best anime of all time but personally i didnt like it and dont understand what made people love it sm what are you guys thoughts"
    },
    {
        "author": "SaintPablo98",
        "created_utc": "Sunday, June 05, 2022 12:46:47",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ssg2/whats_happening_with_code_geass/",
        "selftext": "From what I remember there was gonna be some 10 year project or something around the show? But since the movie in 2019 nothing has been released. Are there plans for a sequel or something?",
        "subreddit": "anime",
        "title": "What's happening with Code Geass?",
        "created": "Saturday, June 04, 2022 04:46:47",
        "removed_by_category": null,
        "Preprocessed post": "from what i remember there was gonna be some 10 year project or something around the show but since the movie in 2019 nothing has been released are there plans for a sequel or something"
    },
    {
        "author": "International_Aside2",
        "created_utc": "Sunday, June 05, 2022 12:43:09",
        "full_link": "https://www.reddit.com/r/anime/comments/v4spxh/animes_that_have_a_character_like_mikazuki/",
        "selftext": "Can I have some anime recommendations that have a character like mikazuki august from iron blooded orphans in it",
        "subreddit": "anime",
        "title": "Animes that have a character like mikazuki",
        "created": "Saturday, June 04, 2022 04:43:09",
        "removed_by_category": null,
        "Preprocessed post": "can i have some anime recommendations that have a character like mikazuki august from iron blooded orphans in it"
    },
    {
        "author": "2aqjmz",
        "created_utc": "Sunday, June 05, 2022 12:40:45",
        "full_link": "https://www.reddit.com/r/anime/comments/v4so8o/is_there_a_websitepage_that_shows_anime_episode/",
        "selftext": "there is imdb, https://www.imdb.com/title/tt2560140/episodes?season=1 but I dont trust imdb users opinions. \n\nmyanimelist.net only has the score of the show. Not separate episodes.",
        "subreddit": "anime",
        "title": "Is there a website/page that shows anime episode scores?",
        "created": "Saturday, June 04, 2022 04:40:45",
        "removed_by_category": null,
        "Preprocessed post": "there is imdb  isURL but i dont trust imdb users opinions myanimelistnet only has the score of the show not separate episodes"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Sunday, June 05, 2022 12:33:58",
        "full_link": "https://www.reddit.com/r/anime/comments/v4sj8i/kunoichi_tsubaki_no_mune_no_uchi_episode_9/",
        "selftext": "*Kunoichi Tsubaki no Mune no Uchi*, episode 9: Of Snakes and Men | What Defines Results\n\nAlternative names: *In the Heart of Kunoichi Tsubaki*\n\n# [Rate this episode here.](https://youpoll.me/79050/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/in-the-heart-of-kunoichi-tsubaki)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/50338/)\n* [AniList](https://anilist.co/anime/141350)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16966)\n* [Kitsu](https://kitsu.io/anime/45464)\n* [Anime-Planet](https://www.anime-planet.com/anime/kunoichi-tsubaki-no-mune-no-uchi)\n* [Official Website](https://kunoichi-tsubaki.com/)\n* **/r/KunoichiTsubaki**\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tzwz1c)|[4.28](https://youpoll.me/75020/r)\n2|[Link](https://redd.it/u51h31)|[4.52](https://youpoll.me/75361/r)\n3|[Link](https://redd.it/ua9bd4)|[4.48](https://youpoll.me/75740/r)\n4|[Link](https://redd.it/ufepqj)|[4.68](https://youpoll.me/76256/r)\n5|[Link](https://redd.it/ukh0gz)|[4.41](https://youpoll.me/76752/r)\n6|[Link](https://redd.it/upl034)|[4.72](https://youpoll.me/77238/r)\n7|[Link](https://redd.it/uuqpzh)|[4.42](https://youpoll.me/77733/r)\n8|[Link](https://redd.it/uzqwna)|[4.82](https://youpoll.me/78386/r)\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Kunoichi Tsubaki no Mune no Uchi - Episode 9 discussion",
        "created": "Saturday, June 04, 2022 04:33:58",
        "removed_by_category": null,
        "Preprocessed post": "kunoichi tsubaki no mune no uchi episode 9 of snakes and men  what defines resultsalternative names in the heart of kunoichi tsubaki rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURL rkunoichitsubakiall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "celeste_fan_139",
        "created_utc": "Sunday, June 05, 2022 12:30:11",
        "full_link": "https://www.reddit.com/r/anime/comments/v4sgdx/theres_a_reedit_of_rezero_season_1_in_bilibili/",
        "selftext": "Is it like a censored version with less blood in it or soemthing? Are there any changes to the story? People say i should start watching isekai with this so yeah",
        "subreddit": "anime",
        "title": "there's a \"re-edit\" of rezero season 1 in bilibili? what is that?",
        "created": "Saturday, June 04, 2022 04:30:11",
        "removed_by_category": null,
        "Preprocessed post": "is it like a censored version with less blood in it or soemthing are there any changes to the story people say i should start watching isekai with this so yeah"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Sunday, June 05, 2022 12:05:02",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ry04/gunjou_no_fanfare_episode_10_discussion/",
        "selftext": "*Gunjou no Fanfare*, episode 10: The Sound of Distant Rain\n\nAlternative names: *Fanfare of Adolescence*\n\n# [Rate this episode here.](https://youpoll.me/79048/)\n\n\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/fanfare-of-adolescence)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/49691/)\n* [AniList](https://anilist.co/anime/138452)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16563)\n* [Kitsu](https://kitsu.io/anime/45030)\n* [Anime-Planet](https://www.anime-planet.com/anime/fanfare-of-adolescence)\n* [Official Website](https://fanfare-anime.com/)\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tumcgt)|[3.28](https://youpoll.me/74664/r)\n2|[Link](https://redd.it/tzw72v)|[3.47](https://youpoll.me/75018/r)\n3|[Link](https://redd.it/u50w5t)|[4.17](https://youpoll.me/75360/r)\n4|[Link](https://redd.it/ua8k0o)|[4.0](https://youpoll.me/75738/r)\n5|[Link](https://redd.it/ufe5zf)|[4.0](https://youpoll.me/76254/r)\n6|[Link](https://redd.it/ukgfw5)|[3.57](https://youpoll.me/76749/r)\n7|[Link](https://redd.it/upk9rm)|[4.33](https://youpoll.me/77236/r)\n8|[Link](https://redd.it/uuq625)|[5.0](https://youpoll.me/77732/r)\n9|[Link](https://redd.it/uzqbwq)|[4.0](https://youpoll.me/78384/r)\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Gunjou no Fanfare - Episode 10 discussion",
        "created": "Saturday, June 04, 2022 04:05:02",
        "removed_by_category": null,
        "Preprocessed post": "gunjou no fanfare episode 10 the sound of distant rainalternative names fanfare of adolescence rate this episode here isURLstreams crunchyroll isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURLall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURL9link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "Icy-Background-1636",
        "created_utc": "Saturday, June 04, 2022 11:54:23",
        "full_link": "https://www.reddit.com/r/anime/comments/v4rpwh/im_looking_for_recommendations_for_gyaru_romance/",
        "selftext": "I’ve already watched and am currently reading sono bisque doll (dress up darling) before anyone comments that.",
        "subreddit": "anime",
        "title": "I’m looking for recommendations for gyaru romance anime or harems where the gyaru comes out on top in the end.",
        "created": "Saturday, June 04, 2022 03:54:23",
        "removed_by_category": null,
        "Preprocessed post": "ive already watched and am currently reading sono bisque doll dress up darling before anyone comments that"
    },
    {
        "author": "Cubamus72",
        "created_utc": "Saturday, June 04, 2022 11:50:34",
        "full_link": "https://www.reddit.com/r/anime/comments/v4rn6p/trying_to_find_a_movie/",
        "selftext": "Trying to find a movie that came out a few years ago. Maybe 2019. It’s about a girl wearing a dress I don’t know if she has super powers but it probably takes place in a Ghost in the shell setting.",
        "subreddit": "anime",
        "title": "Trying to find a movie.",
        "created": "Saturday, June 04, 2022 03:50:34",
        "removed_by_category": null,
        "Preprocessed post": "trying to find a movie that came out a few years ago maybe 2019 its about a girl wearing a dress i dont know if she has super powers but it probably takes place in a ghost in the shell setting"
    },
    {
        "author": "KingSid_46",
        "created_utc": "Saturday, June 04, 2022 11:42:09",
        "full_link": "https://www.reddit.com/r/anime/comments/v4rh4l/joseph_joestar_pencil_sketch/",
        "selftext": "https://i.redd.it/23huzit8jm391.jpg\n\nIg: santoryuu.arts",
        "subreddit": "anime",
        "title": "Joseph Joestar pencil sketch",
        "created": "Saturday, June 04, 2022 03:42:09",
        "removed_by_category": null,
        "Preprocessed post": " isURLig santoryuuarts"
    },
    {
        "author": "RiceEveryDay123",
        "created_utc": "Saturday, June 04, 2022 11:38:49",
        "full_link": "https://www.reddit.com/r/anime/comments/v4reus/what_scarf_style_is_this_episode_9_in_deaimon/",
        "selftext": "anyone know what scarf style does nagomu wear around 15:44?\n\nhttps://preview.redd.it/1smjgubkjm391.png?width=348&amp;format=png&amp;auto=webp&amp;s=b7aaa98e1bd9daef5d3a2249f66494cbc45b1e41",
        "subreddit": "anime",
        "title": "What scarf style is this? episode 9 in deaimon.",
        "created": "Saturday, June 04, 2022 03:38:49",
        "removed_by_category": null,
        "Preprocessed post": "anyone know what scarf style does nagomu wear around 1544 isURL"
    },
    {
        "author": "r56ca",
        "created_utc": "Saturday, June 04, 2022 11:35:11",
        "full_link": "https://www.reddit.com/r/anime/comments/v4rcdg/looking_for_something_similar_to_ninja_scroll/",
        "selftext": "Doesn't have to be, but Ninjas or vampires a plus",
        "subreddit": "anime",
        "title": "Looking for something similar to Ninja Scroll",
        "created": "Saturday, June 04, 2022 03:35:11",
        "removed_by_category": null,
        "Preprocessed post": "doesnt have to be but ninjas or vampires a plus"
    },
    {
        "author": "Jack_KH",
        "created_utc": "Saturday, June 04, 2022 11:23:10",
        "full_link": "https://www.reddit.com/r/anime/comments/v4r3rh/destroying_steinsgate_with_facts_and_logic/",
        "selftext": "First of all, I am not a fluent English-speaker, therefore there may be mistakes and a lack of vocabulary. This is also my first review [here](https://myanimelist.net/profile/Ki11grave/reviews). Secondly, if in order to explain plot holes, you need to come up with theories, then it’s not an explanation. You can’t solve a math problem by adding an extra variable. I am against it also, because it will definitely lead into fans being smarter than creators and fans wrongly thinking that creators are genius. And lastly, I don’t need to watch Steins;Gate 0 or play a VN in order to understand what is going on. Steins;Gate the anime is a self-contained project that is considered to be a masterpiece. It doesn’t need DLCs. And if SG0 explains something, I’m sure it also adds even more plot holes.\n\nSo, I think there are 2 ways of time travelling that make common sense: either it is impossible to change past at all (travelling is a part of Fate’s plan) or an alternative timeline is created where Grandfather Paradox doesn’t exist and where there may be two versions of one person (a time traveler and not). In other words, either Fate exists and you can’t defeat it or it doesn’t exist at all! Any other fictional rule of travelling will lead to questions.\n\nThis show tries to unite these two ways. You can’t change the past but if you change something drastically, then Fate is like: “Yo, I didn’t sign up for this! I’m out.”. If you already don’t smell some bullshit, then I don’t know how else to explain to you that there are some. Anyway, heroes didn’t win the lottery and they are still friends with Faris after her d-mail, so this system works pretty well until it suddenly does not.\n\nSomehow, Faris’ dad is less important than Mayuri. And this guy changed the whole city’s infrastructure! I think that Okabe would still start a resistance against SERN even if Mayuri’s alive. And it doesn’t even have to be SERN who will kill Mayuri! So, why is her death so important!? And what’s with that nonsense car chase scene (episode 21)? Why was the driver doing this? Where did they go after killing the girl? Am I watching Final Destination?\n\nAlso, why Mayuri’s death’s date is always postponed 24 hours later? If an explanation is that it’s a timeline who tells protagonist that he is doing everything right, then \\*\\*\\*\\* this explanation. This means that Fate is too kind. And why did SERN tried to capture heroes one day later also? From their perspective nothing changed (heroes know too much and they built time machine). Why wait one day?\n\nAnother main question is what do SERN, Mr. Braun and Moeka know? And since when they start knowing? Well, they know that heroes were thinking of promulgation, so it must be Braun who heard about it through the window and he told about it to superiors. So SERN already knows about heroes, either because of Braun, or because of a secret database where a first d-mail is located or because they hacked Daru’s PC. Damn, they even launched an operation in order to capture them. So how, please tell me how deleting information from their database days later will change the timeline since SERN already knows that heroes have built a time machine!?!? And why later in a show they aren’t doing anything! They are just letting Okabe doing his timey-whimey stuff!\n\nIt seems that Moeka knows that SERN wants to build a time machine? Why does a pawn know that? Her only goal was to find IBN, she does not need to know about SERN’s secrets! Why did Okabe tell her everything after she mentioned FB (episode 6)? Why did Moeka visit the lab after Luka’s d-mail (episode 9)? Is this because of despair, because she hadn’t found IBN in a shrine (this is what I call “adding an extra variable”)?\n\nNow, in second episode Makise proved that time-travel is impossible. We don’t actually see the discussion in class, just a board with pseudo-science stuff on it, but her statement proved to be right, because in the beginning heroes don’t travel through time. They send their memories through it. But then Amane shows up and boom: physical time travel! I thought that it was one of important world-building rules. Makise proved that it is even theoretically impossible, but no, she was just wrong. And why did Amane forgot everything after travelling to 1975 and remembered everything only and only 11 years before 2010 (episode 16)? Is this because of year 2000 problem (adding variables again)?\n\nAnd why, why exactly does Okabe remember everything? I find it interesting that after building Time Leap Machine our special protagonist is not that special anymore. Why was SERN sending threats? Why was time stopping during Mayuri’s deaths? There was no foreshadowing that Braun is FB, while there were a lot in Amane and Moeka’s cases. In twenty third episode there was a talking about a time paradox. Time paradox!? Damn, I hate when time travel stories tell that people are able to mess with time how they want, but meeting yourself is a huge “no”, somehow.\n\nNow the most ridiculous thing: superstitions actually work in this anime! Right, Luka could change their gender with a help of superstitions! That’s it. I’m done! Steins;Gate lost all my respect as a serious, complex sci-fi project.\n\nWell, no, when a series does something good, it does it good. For example, in first version of alpha timeline Amane didn’t exist. She couldn’t save heroes from SERN, they got captured and now we got a dark future. Amane was born, she travelled to past, saved heroes in thirteenth episode and we got a second version of alpha timeline where SERN is doing nothing to stop Okabe (they could steal the machine while he was not home or idk) and he successfully destroys this timeline. Now look, without future-Okabe’s scream, past-Okabe wouldn’t have noticed Makise’s corpse and wouldn’t have sent his first d-mail. He would just go home and wait for WW3. Then Amane is born, she goes to past and forces protagonist to save Makise, because he is her uncle. But there is no Operation Skuld, therefore he fails, screams and that’s when past-Okabe finds out the corpse, goes to alpha timeline, wins because of everything I described earlier and creates Operation Skuld. How do you like it? Well, actually it’s just one huge variable and we just see a Bootstrap Paradox without a beginning. Now let’s find out why in RadioKaikan there are only two Okabes, and not three.\n\nWhat do I think of Steins;Gate as a whole? It’s OK. I always liked psychological thrillers and time travel stories. And a psychological thriller part is well-done. The atmosphere and color correction is great, the dynamic between heroes and jokes are good. If only plot and its holes weren’t bugging me that much. I watched SG first time 6 years earlier, because I was trying to find a great time travel project. Dark didn’t exist that time, so I watched SG and I remember not liking it much. I expected to see a well-thought, complex series and I didn't get it. When I created my anime list, I gave it 6 based on my feelings. And now, after rewatching, it’s still 6. Seriously, guys, if you want to see a good piece of media about time travel, go watch Dark or play Quantum Break. It just saddens me that many people praise SG and say that it’s perfect, while actually it’s the most overrated anime ever. I believe you can prove me wrong in one thing or two, but I think there are too many wrongs with this show. If you will somehow manage to explain everything to me, I will only be glad and will apologize.",
        "subreddit": "anime",
        "title": "Destroying Steins;Gate with facts and logic",
        "created": "Saturday, June 04, 2022 03:23:10",
        "removed_by_category": null,
        "Preprocessed post": "first of all i am not a fluent englishspeaker therefore there may be mistakes and a lack of vocabulary this is also my first review here isURL secondly if in order to explain plot holes you need to come up with theories then its not an explanation you cant solve a math problem by adding an extra variable i am against it also because it will definitely lead into fans being smarter than creators and fans wrongly thinking that creators are genius and lastly i dont need to watch steinsgate 0 or play a vn in order to understand what is going on steinsgate the anime is a selfcontained project that is considered to be a masterpiece it doesnt need dlcs and if sg0 explains something im sure it also adds even more plot holesso i think there are 2 ways of time travelling that make common sense either it is impossible to change past at all travelling is a part of fates plan or an alternative timeline is created where grandfather paradox doesnt exist and where there may be two versions of one person a time traveler and not in other words either fate exists and you cant defeat it or it doesnt exist at all any other fictional rule of travelling will lead to questionsthis show tries to unite these two ways you cant change the past but if you change something drastically then fate is like yo i didnt sign up for this im out if you already dont smell some bullshit then i dont know how else to explain to you that there are some anyway heroes didnt win the lottery and they are still friends with faris after her dmail so this system works pretty well until it suddenly does notsomehow faris dad is less important than mayuri and this guy changed the whole citys infrastructure i think that okabe would still start a resistance against sern even if mayuris alive and it doesnt even have to be sern who will kill mayuri so why is her death so important and whats with that nonsense car chase scene episode 21 why was the driver doing this where did they go after killing the girl am i watching final destinationalso why mayuris deaths date is always postponed 24 hours later if an explanation is that its a timeline who tells protagonist that he is doing everything right then  this explanation this means that fate is too kind and why did sern tried to capture heroes one day later also from their perspective nothing changed heroes know too much and they built time machine why wait one dayanother main question is what do sern mr braun and moeka know and since when they start knowing well they know that heroes were thinking of promulgation so it must be braun who heard about it through the window and he told about it to superiors so sern already knows about heroes either because of braun or because of a secret database where a first dmail is located or because they hacked darus pc damn they even launched an operation in order to capture them so how please tell me how deleting information from their database days later will change the timeline since sern already knows that heroes have built a time machine and why later in a show they arent doing anything they are just letting okabe doing his timeywhimey stuffit seems that moeka knows that sern wants to build a time machine why does a pawn know that her only goal was to find ibn she does not need to know about serns secrets why did okabe tell her everything after she mentioned fb episode 6 why did moeka visit the lab after lukas dmail episode 9 is this because of despair because she hadnt found ibn in a shrine this is what i call adding an extra variablenow in second episode makise proved that timetravel is impossible we dont actually see the discussion in class just a board with pseudoscience stuff on it but her statement proved to be right because in the beginning heroes dont travel through time they send their memories through it but then amane shows up and boom physical time travel i thought that it was one of important worldbuilding rules makise proved that it is even theoretically impossible but no she was just wrong and why did amane forgot everything after travelling to 1975 and remembered everything only and only 11 years before 2010 episode 16 is this because of year 2000 problem adding variables againand why why exactly does okabe remember everything i find it interesting that after building time leap machine our special protagonist is not that special anymore why was sern sending threats why was time stopping during mayuris deaths there was no foreshadowing that braun is fb while there were a lot in amane and moekas cases in twenty third episode there was a talking about a time paradox time paradox damn i hate when time travel stories tell that people are able to mess with time how they want but meeting yourself is a huge no somehownow the most ridiculous thing superstitions actually work in this anime right luka could change their gender with a help of superstitions thats it im done steinsgate lost all my respect as a serious complex scifi projectwell no when a series does something good it does it good for example in first version of alpha timeline amane didnt exist she couldnt save heroes from sern they got captured and now we got a dark future amane was born she travelled to past saved heroes in thirteenth episode and we got a second version of alpha timeline where sern is doing nothing to stop okabe they could steal the machine while he was not home or idk and he successfully destroys this timeline now look without futureokabes scream pastokabe wouldnt have noticed makises corpse and wouldnt have sent his first dmail he would just go home and wait for ww3 then amane is born she goes to past and forces protagonist to save makise because he is her uncle but there is no operation skuld therefore he fails screams and thats when pastokabe finds out the corpse goes to alpha timeline wins because of everything i described earlier and creates operation skuld how do you like it well actually its just one huge variable and we just see a bootstrap paradox without a beginning now lets find out why in radiokaikan there are only two okabes and not threewhat do i think of steinsgate as a whole its ok i always liked psychological thrillers and time travel stories and a psychological thriller part is welldone the atmosphere and color correction is great the dynamic between heroes and jokes are good if only plot and its holes werent bugging me that much i watched sg first time 6 years earlier because i was trying to find a great time travel project dark didnt exist that time so i watched sg and i remember not liking it much i expected to see a wellthought complex series and i didnt get it when i created my anime list i gave it 6 based on my feelings and now after rewatching its still 6 seriously guys if you want to see a good piece of media about time travel go watch dark or play quantum break it just saddens me that many people praise sg and say that its perfect while actually its the most overrated anime ever i believe you can prove me wrong in one thing or two but i think there are too many wrongs with this show if you will somehow manage to explain everything to me i will only be glad and will apologize"
    },
    {
        "author": "Wow_Space",
        "created_utc": "Saturday, June 04, 2022 11:12:28",
        "full_link": "https://www.reddit.com/r/anime/comments/v4qw21/whats_the_subreddit_with_the_fetish_of_anime/",
        "selftext": "I couldn't google the life of me to find it.",
        "subreddit": "anime",
        "title": "What's the subreddit with the fetish of anime women that are giants towering over them?",
        "created": "Saturday, June 04, 2022 03:12:28",
        "removed_by_category": null,
        "Preprocessed post": "i couldnt google the life of me to find it"
    },
    {
        "author": "celeste_fan_139",
        "created_utc": "Saturday, June 04, 2022 11:09:46",
        "full_link": "https://www.reddit.com/r/anime/comments/v4qu2r/i_want_to_start_watching_isekai_any_places_to/",
        "selftext": "Got holidays so more time on my hands",
        "subreddit": "anime",
        "title": "i want to start watching isekai, any places to start?",
        "created": "Saturday, June 04, 2022 03:09:46",
        "removed_by_category": null,
        "Preprocessed post": "got holidays so more time on my hands"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Saturday, June 04, 2022 11:01:51",
        "full_link": "https://www.reddit.com/r/anime/comments/v4qo5p/spy_x_family_episode_9_discussion/",
        "selftext": "*Spy x Family*, episode 9\n\nAlternative names: *SPY×FAMILY*\n\n# [Rate this episode here.](https://youpoll.me/79045/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/spy-x-family)\n* [Muse Asia](https://www.youtube.com/playlist?list=PLwLSw1_eDZl1wGMYg5oB3uEns0CZNl6sI)\n* [Hulu](https://www.hulu.com/series/spy-family-65d158d4-443f-44c7-bd2c-eae39f6c60e9)\n* [VRV](https://vrv.co/series/G4PH0WXVJ)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/50265/)\n* [AniList](https://anilist.co/anime/140960)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16947)\n* [Kitsu](https://kitsu.io/anime/45398)\n* [Anime-Planet](https://www.anime-planet.com/anime/spy-x-family)\n* [Official Website](https://spy-family.net/)\n* **/r/SpyxFamily**\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tzvqga)|[4.82](https://youpoll.me/75015/r)\n2|[Link](https://redd.it/u4zmhc)|[4.85](https://youpoll.me/75357/r)\n3|[Link](https://redd.it/ua7eg3)|[4.81](https://youpoll.me/75734/r)\n4|[Link](https://redd.it/ufcwz8)|[4.86](https://youpoll.me/76251/r)\n5|[Link](https://redd.it/ukf5xs)|[4.75](https://youpoll.me/76744/r)\n6|[Link](https://redd.it/upj5b0)|[4.86](https://youpoll.me/77234/r)\n7|[Link](https://redd.it/uuoxjf)|[4.74](https://youpoll.me/77727/r)\n8|[Link](https://redd.it/uzp2w0)|[4.5](https://youpoll.me/78379/r)\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Spy x Family - Episode 9 discussion",
        "created": "Saturday, June 04, 2022 03:01:51",
        "removed_by_category": null,
        "Preprocessed post": "spy x family episode 9alternative names spyfamily rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURL muse asia isURL hulu isURL vrv isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURL rspyxfamilyall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "Impressive-Truth-681",
        "created_utc": "Saturday, June 04, 2022 10:36:57",
        "full_link": "https://www.reddit.com/r/anime/comments/v4q6bm/help_finding_2000s_anime/",
        "selftext": "Looking for anime\n\nI don’t know to much about this anime but I remember watching it as a kid around 2005-2009 it aired on YTV (Canada). It had a pretty dark tone to it and I remember the characters remind me of inyuasha but with long black hair (similar to super saiyan 3 but black hair) they also had longer fingernails like inyuasha.",
        "subreddit": "anime",
        "title": "Help finding 2000s anime",
        "created": "Saturday, June 04, 2022 02:36:57",
        "removed_by_category": null,
        "Preprocessed post": "looking for animei dont know to much about this anime but i remember watching it as a kid around 20052009 it aired on ytv canada it had a pretty dark tone to it and i remember the characters remind me of inyuasha but with long black hair similar to super saiyan 3 but black hair they also had longer fingernails like inyuasha"
    },
    {
        "author": "NamTrees",
        "created_utc": "Saturday, June 04, 2022 10:31:37",
        "full_link": "https://www.reddit.com/r/anime/comments/v4q2ga/what_are_some_good_animes_to_watch_before_i/",
        "selftext": "I’m going to be graduating in a couple of weeks so I was wondering before that happens what are good hs animes I should watch?",
        "subreddit": "anime",
        "title": "What are some good animes to watch before I graduate?",
        "created": "Saturday, June 04, 2022 02:31:37",
        "removed_by_category": null,
        "Preprocessed post": "im going to be graduating in a couple of weeks so i was wondering before that happens what are good hs animes i should watch"
    },
    {
        "author": "movei101",
        "created_utc": "Saturday, June 04, 2022 10:00:33",
        "full_link": "https://www.reddit.com/r/anime/comments/v4phaj/i_am_trying_to_remember_an_old_anime_ive_watched/",
        "selftext": "Hey thank you to anyone who can help with this. I have been looking for this one anime that I used to watch for quite awhile now and have been having zero luck. It's was set in a destroyed city (I believe in japan) that was hit by a bomb that gave some people powers. The main protagonist is a male who didn't think he had any powers (if I remember right lol sorry it was a few years ago and ive watched so many since then.) He meets a group of people who help him out (I remember one is obsessed with some food or drink.) They eventually go to overthrow the government and are fighting a gauntlet of people and than the main protagonists sister joins in on the governments side (not willingly). They eventually free her than go on to over throw the government I believe. The only other things I can remember is that they call where the bomb blew up 'the balck hole'  (or something along those lines.) I'm sorry that I don't remember more and that this wasn't very detailed. Any help would be very much appreciated",
        "subreddit": "anime",
        "title": "I am trying to remember an old anime I've watched.",
        "created": "Saturday, June 04, 2022 02:00:33",
        "removed_by_category": null,
        "Preprocessed post": "hey thank you to anyone who can help with this i have been looking for this one anime that i used to watch for quite awhile now and have been having zero luck its was set in a destroyed city i believe in japan that was hit by a bomb that gave some people powers the main protagonist is a male who didnt think he had any powers if i remember right lol sorry it was a few years ago and ive watched so many since then he meets a group of people who help him out i remember one is obsessed with some food or drink they eventually go to overthrow the government and are fighting a gauntlet of people and than the main protagonists sister joins in on the governments side not willingly they eventually free her than go on to over throw the government i believe the only other things i can remember is that they call where the bomb blew up the balck hole  or something along those lines im sorry that i dont remember more and that this wasnt very detailed any help would be very much appreciated"
    },
    {
        "author": "puppetplaygames",
        "created_utc": "Saturday, June 04, 2022 09:57:11",
        "full_link": "https://www.reddit.com/r/anime/comments/v4peus/i_dont_know_anime_name/",
        "selftext": "There is an anime i dont know the name to it's a card game anime not yugiu old style and has machine robots and cars and motorcycles transform from the cards and there was a team of kids I guess  and I remember an antoganist with white hair pls help",
        "subreddit": "anime",
        "title": "I dont know anime name",
        "created": "Saturday, June 04, 2022 01:57:11",
        "removed_by_category": null,
        "Preprocessed post": "there is an anime i dont know the name to its a card game anime not yugiu old style and has machine robots and cars and motorcycles transform from the cards and there was a team of kids i guess  and i remember an antoganist with white hair pls help"
    },
    {
        "author": "belmadja",
        "created_utc": "Saturday, June 04, 2022 09:56:14",
        "full_link": "https://www.reddit.com/r/anime/comments/v4pe9u/looking_for_a_specific_anime_but_i_basically_dont/",
        "selftext": "Hello,\n\nAs the title I'm looking for a specific anime I watched a long time ago (5,6years). When looking at my list of watched animes I suddenly remembered  scenes I watched without knowing which anime they came from. Which is hella frustrating. I've looked through a bunch of list but could not find it. \n\nI don't remember much, and I'm afraid I might confuse with other things I've wached, but here is what I remember, which is very little things : \n\n\\- A young highschooler is paired up with a young lady (same school). I believe the guy has some kind of bad reputation : being weak or lazy. By paired up I don't remember why, I think he is supposed to protect her. At the beginning they are not pleased by the sitation but I believe they develop some romantic feelings between them.\n\n\\- It's not on the tragic side. There are often comical elements\n\n\\- the most unique thing I remember is that the MC and the antagonist fight each other in the air (not falling or flying : more like in a dirigeble if I recall correctly). That was the last episode I watched, I believe it was the end of anime or the first season of that anime.\n\n&amp;#x200B;\n\nIt's vague. Even if you don't know any recommandation is welcome. As I said I might confuse some elements with other animes, so if u think of something that does not correspond perfectly it's really not a problem.\n\n&amp;#x200B;\n\nThanks in advance.",
        "subreddit": "anime",
        "title": "Looking for a specific anime but I basically don't remember anything (type : school life/action)",
        "created": "Saturday, June 04, 2022 01:56:14",
        "removed_by_category": null,
        "Preprocessed post": "helloas the title im looking for a specific anime i watched a long time ago 56years when looking at my list of watched animes i suddenly remembered  scenes i watched without knowing which anime they came from which is hella frustrating ive looked through a bunch of list but could not find it i dont remember much and im afraid i might confuse with other things ive wached but here is what i remember which is very little things   a young highschooler is paired up with a young lady same school i believe the guy has some kind of bad reputation  being weak or lazy by paired up i dont remember why i think he is supposed to protect her at the beginning they are not pleased by the sitation but i believe they develop some romantic feelings between them its not on the tragic side there are often comical elements the most unique thing i remember is that the mc and the antagonist fight each other in the air not falling or flying  more like in a dirigeble if i recall correctly that was the last episode i watched i believe it was the end of anime or the first season of that animeampx200bits vague even if you dont know any recommandation is welcome as i said i might confuse some elements with other animes so if u think of something that does not correspond perfectly its really not a problemampx200bthanks in advance"
    },
    {
        "author": "Gamer_jaginder",
        "created_utc": "Saturday, June 04, 2022 09:52:03",
        "full_link": "https://www.reddit.com/r/anime/comments/v4pbhe/so_its_been_1_year_since_i_started_watching_anime/",
        "selftext": "1. Tsuki Ga Kirei. \n\n2. Hi score girl. \n\n3. Gamers!  \n\n4. Just because \n\n5. Hajimete no gal.  \n\n6. L. Tyrant \n\n7. Tonikawa.    \n        \n8. The famaliar of Zero\n  \n9. My teen romantic Comedy \n\n10. Beelzebub \n\n11. Tsurezure children. \n\n12. The pet girl of sakurasou. \n\n13. Rascal doesn't dream of bunny girl  \n\n14. The testament of new sister devil\n\n15. Photokano\n\n16. Yosuga no Sora\n\n17. Boku no Kanojo\n\n18. Prison school\n\n19. High School DxD\n\n20. Majo No Tabitabi\n\n21. Okusama ga Seitokaichou\n\n22. Eromanga-sensei\n\n23. Tokyo revengers\n\n24. Plunderer\n\n25. 91 days\n\n26. Hyouka\n\n27. Attack on Titans\n\n28. God of Highschool\n\n29. Death Parade\n\n30. Wolf girl and black prince\n\n31. Kimi no Nawa\n\n32. Kenichi the mightiest disciple\n\n33. One Punch Man\n\n34. Tamako Love Story\n\n35. Armed girls machiavellism\n\n36. Saenai Heroine no Sodatekata Fine\n\n37. Kokoro Connect\n\n38. Oreshura\n\n39. Ladies vs Butlers\n\n40. Sword Art Online\n\n41. Maid sama\n\n42. My hero academia\n\n43. No game no life\n\n44. And you thought there's never a girl online\n\n45. Haikyuu\n\n46. Nanbaka\n\n47. Uzaki chan wants to hang out\n\n48. A town where you live\n\n49. AntiMagic Academy 35th Test Platoon\n\n50. Your lie in April\n\n51. Walkure Romanze\n\n52. Demon slayer\n\n53. Record of Ragnarok\n\n54. Violet Evergarden\n\n55. Jujutsu Kaisen \n\n56. Black Clover\n\n57. Shattered Angels\n\n58. Tower of God\n\n59. Arifureta\n\n60. That time I got reincarnated as a Slime\n\n61. Don't Toy with Me, Miss Nagatoro\n\n62. Himouto! Umaru-chan\n\n63. The Misfit of Demon King Academy\n\n64. The Rising of the Shield Hero\n\n65. Twin Star Exorcists\n\n66. Sk8 Infinite\n\n67. Welcome to demon world Irina kun\n\n68. Nande Koko ni Sensei ga!?\n\n69. Devil is a part timer\n\n70. Blue excorcist\n\n71. Toradora\n\n72. Classroom of the elite\n\n73. Tada Never Falls in Love\n\n74. Naruto\n\n75. Shomin sample\n\n76. Mob psycho\n\n77. ViVid Strike!\n\n78. Baby steps\n\n79. Fruits basket\n\n80. How Not to Summon a Demon Lord\n\n81. The Knight in the Area\n\n82. Full time magister\n\n83. Grand Blue Dreaming\n\n84. Daily Lives of High School Boys\n\n85. Reikenzan Hoshikuzu Tachi No Utage\n\n86. Charlotte\n\n87. Teasing master Takagi San\n\n88. Hunter x Hunter\n\n89. Kaifuku Jutsushi no Yarinaoshi(redo of healer)\n\n90. Welcome to Ballroom\n\n91. Prince of Stride: Alternative\n\n92. Shakunetsu Kabaddi\n\n93. Horimiya\n\n94. Seirei Gensouki\n\n95. Seiren\n\n96. Blue Period\n\n97. Ace of Diamond\n\n98. Masamune-kun no Revenge\n\n99. Rokudenashi Majutsu Koushi to Akashic Records\n\n100. Ishuzoku Reviewers \n\n101. Baki\n\n102. Sekai Saikou no Ansatsusha, Isekai Kizoku ni Tensei suru\n\n103. Bakuman\n\n104. Flying witch\n\n105. Cross game\n\n106. Re Life\n\n107. Hiatari Ryoukou!\n\n108. Jaku-Chara Tomozaki-kun\n\n109. Suzuka\n\n110. Kono Suba\n\n111. Chuunibyou\n\n112. Golden time\n\n113. Nagi no Asukara\n\n114. Ao Haru Ride\n\n115. CHOYOYU!: High School Prodigies Have It Easy Even in Another World!\n\n116. Mother of the Goddess' Dormitory\n\n117. Tanaka kun is always listless\n\n118. Working\n\n119. Megami-ryou no Ryoubo-kun\n\n120. Engaged to the unidentified\n\n121. Ousama Ranking\n\n122. Bokutachi no Remake\n\n123. Love, Election and Chocolate\n\n124. Aho Girl\n\n125. Sabikui Bisco\n\n126. Inazuma eleven (1st season)\n\n127. Clean Freak! Aoyama-kun\n\n128. Little Witch Academia\n\n129. Scums wish\n\n130. Suppose a Kid from the Last Dungeon Boonies moved to a starter town?\n\n131. Aharen Is Indecipherable\n\n132. Girls &amp; Panzer\n\n133. Ao Ashi\n\n134. The Greatest Demon Lord Is Reborn as a Typical Nobody\n\n135. Yuusha, Yamemasu\n\n136. Paripi Koumei\n\n137. Spy x Family\n\n138. Shikimori's Not Just a Cutie\n\n139. Pokèmon\n\n140. Combatants Will Be Dispatched!\n\n141. Cautious Hero: The Hero Is Overpowered but Overly Cautious\n\n142. Armor Shop for Ladies &amp; Gentlemen\n\n143. Captain tsubasa\n\n144. Keijo\n\n145. Busted darklord\n\n146. Kandagawa Jet Girls\n\n147. UQ Holder!\n\n148. Tawawa on Monday Two\n\n149. The Daily Life of the Immortal King 2nd Season\n\n150. One piece\n\nStarted one piece a lot earlier but didn't add to list cuz it was ongoing. Same with Pokemon.",
        "subreddit": "anime",
        "title": "So it's been 1 year since I started watching anime and here's the list of all anime I've watched. Your thoughts and suggestions?",
        "created": "Saturday, June 04, 2022 01:52:03",
        "removed_by_category": null,
        "Preprocessed post": "1 tsuki ga kirei 2 hi score girl 3 gamers  4 just because 5 hajimete no gal  6 l tyrant 7 tonikawa            8 the famaliar of zero  9 my teen romantic comedy 10 beelzebub 11 tsurezure children 12 the pet girl of sakurasou 13 rascal doesnt dream of bunny girl  14 the testament of new sister devil15 photokano16 yosuga no sora17 boku no kanojo18 prison school19 high school dxd20 majo no tabitabi21 okusama ga seitokaichou22 eromangasensei23 tokyo revengers24 plunderer25 91 days26 hyouka27 attack on titans28 god of highschool29 death parade30 wolf girl and black prince31 kimi no nawa32 kenichi the mightiest disciple33 one punch man34 tamako love story35 armed girls machiavellism36 saenai heroine no sodatekata fine37 kokoro connect38 oreshura39 ladies vs butlers40 sword art online41 maid sama42 my hero academia43 no game no life44 and you thought theres never a girl online45 haikyuu46 nanbaka47 uzaki chan wants to hang out48 a town where you live49 antimagic academy 35th test platoon50 your lie in april51 walkure romanze52 demon slayer53 record of ragnarok54 violet evergarden55 jujutsu kaisen 56 black clover57 shattered angels58 tower of god59 arifureta60 that time i got reincarnated as a slime61 dont toy with me miss nagatoro62 himouto umaruchan63 the misfit of demon king academy64 the rising of the shield hero65 twin star exorcists66 sk8 infinite67 welcome to demon world irina kun68 nande koko ni sensei ga69 devil is a part timer70 blue excorcist71 toradora72 classroom of the elite73 tada never falls in love74 naruto75 shomin sample76 mob psycho77 vivid strike78 baby steps79 fruits basket80 how not to summon a demon lord81 the knight in the area82 full time magister83 grand blue dreaming84 daily lives of high school boys85 reikenzan hoshikuzu tachi no utage86 charlotte87 teasing master takagi san88 hunter x hunter89 kaifuku jutsushi no yarinaoshiredo of healer90 welcome to ballroom91 prince of stride alternative92 shakunetsu kabaddi93 horimiya94 seirei gensouki95 seiren96 blue period97 ace of diamond98 masamunekun no revenge99 rokudenashi majutsu koushi to akashic records100 ishuzoku reviewers 101 baki102 sekai saikou no ansatsusha isekai kizoku ni tensei suru103 bakuman104 flying witch105 cross game106 re life107 hiatari ryoukou108 jakuchara tomozakikun109 suzuka110 kono suba111 chuunibyou112 golden time113 nagi no asukara114 ao haru ride115 choyoyu high school prodigies have it easy even in another world116 mother of the goddess dormitory117 tanaka kun is always listless118 working119 megamiryou no ryoubokun120 engaged to the unidentified121 ousama ranking122 bokutachi no remake123 love election and chocolate124 aho girl125 sabikui bisco126 inazuma eleven 1st season127 clean freak aoyamakun128 little witch academia129 scums wish130 suppose a kid from the last dungeon boonies moved to a starter town131 aharen is indecipherable132 girls amp panzer133 ao ashi134 the greatest demon lord is reborn as a typical nobody135 yuusha yamemasu136 paripi koumei137 spy x family138 shikimoris not just a cutie139 pokèmon140 combatants will be dispatched141 cautious hero the hero is overpowered but overly cautious142 armor shop for ladies amp gentlemen143 captain tsubasa144 keijo145 busted darklord146 kandagawa jet girls147 uq holder148 tawawa on monday two149 the daily life of the immortal king 2nd season150 one piecestarted one piece a lot earlier but didnt add to list cuz it was ongoing same with pokemon"
    },
    {
        "author": "ParticularFrosty6352",
        "created_utc": "Saturday, June 04, 2022 09:46:16",
        "full_link": "https://www.reddit.com/r/anime/comments/v4p7sw/your_favorite_anime_couples_from_80s00s_anime/",
        "selftext": "Which is your favorite couples from old animes ?",
        "subreddit": "anime",
        "title": "Your favorite anime couples from 80s-00s anime",
        "created": "Saturday, June 04, 2022 01:46:16",
        "removed_by_category": null,
        "Preprocessed post": "which is your favorite couples from old animes "
    },
    {
        "author": "Yumi_Kdrama",
        "created_utc": "Saturday, June 04, 2022 09:44:58",
        "full_link": "https://www.reddit.com/r/anime/comments/v4p6yw/suggestions_for_good_romcom_animes/",
        "selftext": "Hi guys, \n\nCan anyone suggest some good romcoms. I have seen horimiya and kaichou wa maid sama and totally fell in love with them. I would really be happy to get some good suggestions like these.",
        "subreddit": "anime",
        "title": "Suggestions for good romcom animes",
        "created": "Saturday, June 04, 2022 01:44:58",
        "removed_by_category": null,
        "Preprocessed post": "hi guys can anyone suggest some good romcoms i have seen horimiya and kaichou wa maid sama and totally fell in love with them i would really be happy to get some good suggestions like these"
    },
    {
        "author": "LoudyKing101",
        "created_utc": "Saturday, June 04, 2022 09:43:31",
        "full_link": "https://www.reddit.com/r/anime/comments/v4p624/how_come_some_people_say_that_deku_is_a_bad/",
        "selftext": "Keep in mind, I have only seen Season 1 of MHA, but the points here still stand.\nDeku is a great protagonist honestly. He is a nice guy who risks his life for anyone, whether it be his friends, family, or someone he doesn't even know well. The anger that he sometimes shows merely comes from his rivalry with Bakugo.\nDeku does have a sensitive side, and I think that is why a lot of fans make fun of him. But to be honest, he most likely will mature. Not all anime characters start out perfect, you know.\nSo, yeah, I really don't understand why some people hate him. Maybe he does something that is really bad and unforgivable later on. I don't know.",
        "subreddit": "anime",
        "title": "How come some people say that Deku is a bad Shonen protagonist?",
        "created": "Saturday, June 04, 2022 01:43:31",
        "removed_by_category": null,
        "Preprocessed post": "keep in mind i have only seen season 1 of mha but the points here still standdeku is a great protagonist honestly he is a nice guy who risks his life for anyone whether it be his friends family or someone he doesnt even know well the anger that he sometimes shows merely comes from his rivalry with bakugodeku does have a sensitive side and i think that is why a lot of fans make fun of him but to be honest he most likely will mature not all anime characters start out perfect you knowso yeah i really dont understand why some people hate him maybe he does something that is really bad and unforgivable later on i dont know"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Saturday, June 04, 2022 09:30:15",
        "full_link": "https://www.reddit.com/r/anime/comments/v4oxku/love_live_nijigasaki_gakuen_school_idol_doukoukai/",
        "selftext": "*Love Live! Nijigasaki Gakuen School Idol Doukoukai Season 2*, episode 10: Episode 10\n\nAlternative names: *Love Live! Nijigasaki High School Idol Club Season 2*\n\n# [Rate this episode here.](https://youpoll.me/79040/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/love-live-nijigasaki-high-school-idol-club)\n* [Funimation](https://www.funimation.com/shows/love-live-nijigasaki-high-school-idol-club/#videos)\n* [VRV](https://vrv.co/series/G63W41WQ6)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/48916/)\n* [AniList](https://anilist.co/anime/133891)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16310)\n* [Kitsu](https://kitsu.io/anime/44537)\n* [Anime-Planet](https://www.anime-planet.com/anime/love-live-nijigasaki-high-school-idol-club-season-2)\n* [Official Website](http://www.lovelive-anime.jp/nijigasaki/)\n* **/r/LoveLive**\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tuizzd)|[4.36](https://youpoll.me/74660/r)\n2|[Link](https://redd.it/tztamm)|[4.57](https://youpoll.me/75011/r)\n3|[Link](https://redd.it/u4xvlh)|[4.45](https://youpoll.me/75353/r)\n4|[Link](https://redd.it/ua5ko5)|[4.23](https://youpoll.me/75721/r)\n5|[Link](https://redd.it/ufb6xd)|[4.66](https://youpoll.me/76247/r)\n6|[Link](https://redd.it/ukde1a)|[4.81](https://youpoll.me/76742/r)\n7|[Link](https://redd.it/uphdzd)|[4.55](https://youpoll.me/77227/r)\n8|[Link](https://redd.it/uun6lu)|[4.38](https://youpoll.me/77721/r)\n9|[Link](https://redd.it/uznhap)|[4.85](https://youpoll.me/78371/r)\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Love Live! Nijigasaki Gakuen School Idol Doukoukai Season 2 - Episode 10 discussion",
        "created": "Saturday, June 04, 2022 01:30:15",
        "removed_by_category": null,
        "Preprocessed post": "love live nijigasaki gakuen school idol doukoukai season 2 episode 10 episode 10alternative names love live nijigasaki high school idol club season 2 rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURL funimation isURL vrv isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURL rloveliveall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURL9link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "InsomniaEmperor",
        "created_utc": "Saturday, June 04, 2022 09:19:27",
        "full_link": "https://www.reddit.com/r/anime/comments/v4oqln/can_anyone_give_me_cases_where_for_an_episode_the/",
        "selftext": "I'm not talking about cases where the OP or ED is originally performed by one of the characters' voice actors like the Quintessential Quintuplets OP being performed by the quints voice actors. I'm talking about cases where normally it's somebody else singing it but for a certain episode, they change the singer so it features a certain character instead. The most recent one I can think of is Love After World Domination where in episode 6, Culverin Bear sings the OP instead of Yukari Tamura and honestly, the Culverin Bear version of the OP is so much better and more chad than the original. Another case is World Finest Assassin where for a certain episode, Dia sings the ED instead and considering what happened in the episode and the post credits scene, it hits really hard. I just think it's cool when they do that and it adds some flavor.",
        "subreddit": "anime",
        "title": "Can anyone give me cases where for an episode, the anime's OP/ED is sung by one of the characters instead?",
        "created": "Saturday, June 04, 2022 01:19:27",
        "removed_by_category": null,
        "Preprocessed post": "im not talking about cases where the op or ed is originally performed by one of the characters voice actors like the quintessential quintuplets op being performed by the quints voice actors im talking about cases where normally its somebody else singing it but for a certain episode they change the singer so it features a certain character instead the most recent one i can think of is love after world domination where in episode 6 culverin bear sings the op instead of yukari tamura and honestly the culverin bear version of the op is so much better and more chad than the original another case is world finest assassin where for a certain episode dia sings the ed instead and considering what happened in the episode and the post credits scene it hits really hard i just think its cool when they do that and it adds some flavor"
    },
    {
        "author": "No-Mountain-6178",
        "created_utc": "Saturday, June 04, 2022 09:02:52",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ofzb/anime_about_psychology_strategies_with_a_badass_mc/",
        "selftext": "like death note, classroom of the elite, and tomadachi game where it isn't mainly about fighting and some common things but about strategies, manipulation, or battle of wits.",
        "subreddit": "anime",
        "title": "anime about psychology strategies with a badass mc.",
        "created": "Saturday, June 04, 2022 01:02:52",
        "removed_by_category": null,
        "Preprocessed post": "like death note classroom of the elite and tomadachi game where it isnt mainly about fighting and some common things but about strategies manipulation or battle of wits"
    },
    {
        "author": "Puzzleheaded_Trick56",
        "created_utc": "Saturday, June 04, 2022 08:40:32",
        "full_link": "https://www.reddit.com/r/anime/comments/v4o279/looking_for_comedy_anime_with_good_animation/",
        "selftext": "So basically something like spy x family or millionaire detective. Its really simple, if the anime doesnt have comedy then dont post it. I physically cant bare myself to watch an anime without comedy.",
        "subreddit": "anime",
        "title": "looking for comedy anime with good animation",
        "created": "Saturday, June 04, 2022 12:40:32",
        "removed_by_category": null,
        "Preprocessed post": "so basically something like spy x family or millionaire detective its really simple if the anime doesnt have comedy then dont post it i physically cant bare myself to watch an anime without comedy"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Saturday, June 04, 2022 08:33:46",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ny70/yatogamechan_kansatsu_nikki_season_4_episode_9/",
        "selftext": "*Yatogame-chan Kansatsu Nikki Season 4*, episode 9: Welcome, Honored Guest\n\nAlternative names: *Yatogame-chan Kansatsu Nikki Season 4*\n\n# [Rate this episode here.](https://youpoll.me/79036/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/yatogame-chan-kansatsu-nikki)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/50438/)\n* [AniList](https://anilist.co/anime/142016)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=17003)\n* [Anime-Planet](https://www.anime-planet.com/anime/yatogame-chan-kansatsu-nikki-4)\n* [Official Website](https://yatogame.nagoya/)\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tzsb3b)|[4.71](https://youpoll.me/75008/r)\n2|[Link](https://redd.it/u4ww9z)|[4.56](https://youpoll.me/75350/r)\n3|[Link](https://redd.it/ua4fpr)|[4.43](https://youpoll.me/75717/r)\n4|[Link](https://redd.it/ufa55a)|[4.0](https://youpoll.me/76245/r)\n5|[Link](https://redd.it/ukcev9)|[3.86](https://youpoll.me/76741/r)\n6|[Link](https://redd.it/upg9z0)|[4.33](https://youpoll.me/77223/r)\n7|[Link](https://redd.it/uum745)|[4.0](https://youpoll.me/77718/r)\n8|[Link](https://redd.it/uzmdrb)|[3.75](https://youpoll.me/78368/r)\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Yatogame-chan Kansatsu Nikki Season 4 - Episode 9 discussion",
        "created": "Saturday, June 04, 2022 12:33:46",
        "removed_by_category": null,
        "Preprocessed post": "yatogamechan kansatsu nikki season 4 episode 9 welcome honored guestalternative names yatogamechan kansatsu nikki season 4 rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURLshow information myanimelist isURL anilist isURL anidb isURL animeplanet isURL official website isURLall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "iaamweeabowo",
        "created_utc": "Saturday, June 04, 2022 08:29:32",
        "full_link": "https://www.reddit.com/r/anime/comments/v4nvlf/funny_andor_very_bad_anime_dubs/",
        "selftext": "Are there any more animes that have got funny dubs, or dubs so bad they are good? All I can think of right now are the [BBC dub for Lum the invader girl](https://youtu.be/SumdIkmSNog) and [ghost stories](https://www.youtube.com/watch?v=h4VqZTKY38Y).",
        "subreddit": "anime",
        "title": "Funny (and/or very bad) anime dubs",
        "created": "Saturday, June 04, 2022 12:29:32",
        "removed_by_category": null,
        "Preprocessed post": "are there any more animes that have got funny dubs or dubs so bad they are good all i can think of right now are the bbc dub for lum the invader girl isURL and ghost stories isURL"
    },
    {
        "author": "abrahemhke",
        "created_utc": "Saturday, June 04, 2022 08:27:27",
        "full_link": "https://www.reddit.com/r/anime/comments/v4nuek/looking_for_an_anime_i_saw_on_youtube_shorts_one/",
        "selftext": "There was a space crew celebration and then one if them dropped a bottle and then a guy who i assume is the protag catches it revealing he has both cyborg legs and hands and the one who throw it starts to apologies and he even cries a little i thought it looked interesting but now i lost it and can't seem to find the name",
        "subreddit": "anime",
        "title": "looking for an anime i saw on YouTube shorts one time",
        "created": "Saturday, June 04, 2022 12:27:27",
        "removed_by_category": null,
        "Preprocessed post": "there was a space crew celebration and then one if them dropped a bottle and then a guy who i assume is the protag catches it revealing he has both cyborg legs and hands and the one who throw it starts to apologies and he even cries a little i thought it looked interesting but now i lost it and cant seem to find the name"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Saturday, June 04, 2022 08:04:54",
        "full_link": "https://www.reddit.com/r/anime/comments/v4nhhp/aoashi_episode_9_discussion/",
        "selftext": "*Aoashi*, episode 9: A Broader Soccer\n\n\n\n# [Rate this episode here.](https://youpoll.me/79034/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/aoashi)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/49052/)\n* [AniList](https://anilist.co/anime/134732)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16358)\n* [Kitsu](https://kitsu.io/anime/44629)\n* [Anime-Planet](https://www.anime-planet.com/anime/aoashi)\n* [Official Website](https://aoashi-pr.com/)\n* **/r/Ao_Ashi**\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tzvzn7)|[4.63](https://youpoll.me/75017/r)\n2|[Link](https://redd.it/u4wbx9)|[4.66](https://youpoll.me/75347/r)\n3|[Link](https://redd.it/ua3ylh)|[4.42](https://youpoll.me/75713/r)\n4|[Link](https://redd.it/uf9p57)|[4.76](https://youpoll.me/76243/r)\n5|[Link](https://redd.it/ukbu6w)|[4.88](https://youpoll.me/76738/r)\n6|[Link](https://redd.it/upftes)|[4.73](https://youpoll.me/77222/r)\n7|[Link](https://redd.it/uulqmr)|[4.39](https://youpoll.me/77717/r)\n8|[Link](https://redd.it/uzlx5e)|[4.43](https://youpoll.me/78367/r)\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Aoashi - Episode 9 discussion",
        "created": "Saturday, June 04, 2022 12:04:54",
        "removed_by_category": null,
        "Preprocessed post": "aoashi episode 9 a broader soccer rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURL rao_ashiall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "Less-You4689",
        "created_utc": "Saturday, June 04, 2022 07:50:07",
        "full_link": "https://www.reddit.com/r/anime/comments/v4n93n/is_spy_x_family_a_plot_driven_anime/",
        "selftext": "Hey guys!! I really want to get into Spy x Family and I was wondering before I watch the series. Does it get any serious or is it all wholesome stuff? Anime and Manga.",
        "subreddit": "anime",
        "title": "Is Spy x Family a plot driven anime?",
        "created": "Saturday, June 04, 2022 11:50:07",
        "removed_by_category": null,
        "Preprocessed post": "hey guys i really want to get into spy x family and i was wondering before i watch the series does it get any serious or is it all wholesome stuff anime and manga"
    },
    {
        "author": "ReputationLogical323",
        "created_utc": "Saturday, June 04, 2022 07:24:31",
        "full_link": "https://www.reddit.com/r/anime/comments/v4mvuu/the_best_anime_borderline_h/",
        "selftext": "what would be the best borderline h for you? because I know very few animes with this tag",
        "subreddit": "anime",
        "title": "the best anime borderline h?",
        "created": "Saturday, June 04, 2022 11:24:31",
        "removed_by_category": null,
        "Preprocessed post": "what would be the best borderline h for you because i know very few animes with this tag"
    },
    {
        "author": "NarwhalSanchez",
        "created_utc": "Saturday, June 04, 2022 07:22:06",
        "full_link": "https://www.reddit.com/r/anime/comments/v4munh/random_anime_scrolling_cringe/",
        "selftext": "A few times before I go to bed I’ll put some random anime to go to sleep to. It’s usually been an isekai that has an OP character with 1D side characters but you watch it to pass the time. Love After World Domination, though. Im 10mins in and it’s so bad. I hate it, but I’m also laughing at how bad it is. It’s like power rangers - the anime",
        "subreddit": "anime",
        "title": "Random anime scrolling cringe",
        "created": "Saturday, June 04, 2022 11:22:06",
        "removed_by_category": null,
        "Preprocessed post": "a few times before i go to bed ill put some random anime to go to sleep to its usually been an isekai that has an op character with 1d side characters but you watch it to pass the time love after world domination though im 10mins in and its so bad i hate it but im also laughing at how bad it is its like power rangers  the anime"
    },
    {
        "author": "Shikurra",
        "created_utc": "Saturday, June 04, 2022 07:20:07",
        "full_link": "https://www.reddit.com/r/anime/comments/v4mtn9/im_having_a_difficult_time_finding_anime/",
        "selftext": "Yeah I've checked the 2 roosters this subreddit made and took my sweet time googling and just scrolling through anime websites, even through trying multiple anime I still can't find any that interest me.\n\nI'll just tell the anime I've watched so far maybe you guys can find one I'd like with what they have in common.\n\nNaruto &amp; Shippuden, HxH, Kingdom, SAO, Overlord, Seraph,\nBleach, Saitama, AOT, Iruma-kun, Black clover, Todomachi game, Re-life, Re:zero, Demon slayer, Jujutsu Kaisen, Slime,\nDeath note, Classroom of the Elite, Mushoku Tensei, Bersek,\nPlatinum End, Tokyo Revengers, NHK, Souten No Ken, Goblin Slayer, Baki, Hajime no Ippo, Mob, Dragonball, Noblesse, Makukucity Actors, Arifureta.\n\nJust so people don't suggest the following because They couldn't hook me up after a few episodes (2-8): \nMHA, Fairy Tail, One piece, Tokyo Ghoul, Vinland, Black Jack, Redo of the healer, Log horizon, Spy x Family, Boruto, Gintama, Shield hero, Fate, Dragon Quest, Sailor moon.\n\nThough I prefer long anime I'm fine with 12 episode length and I dislike episodic anime like gintama, one piece and psychic.\nHarem and ecchi not preferred but as long as it's not too focused on it unlike Arifureta, Shield hero.\n\nBonus for psychological and mind games like Log horizon, Death book, Classroom of the elite, Platinum end, Overlord and Tosomaxhi game.\n\nBonus for weak MC that suffers and doesn't get better soon\nLike Re:Zero and Shield hero.\n\nAnime that's The best: Naruto + Shippuden, HxH, Bleach, Re:Zero, Death note, Berserk, NHK, AOT early seasons.\n\nI hope the wall'o'text isn't too big, I might have to format it if I don't get enough suggestions.",
        "subreddit": "anime",
        "title": "I'm having a difficult time finding anime",
        "created": "Saturday, June 04, 2022 11:20:07",
        "removed_by_category": null,
        "Preprocessed post": "yeah ive checked the 2 roosters this subreddit made and took my sweet time googling and just scrolling through anime websites even through trying multiple anime i still cant find any that interest meill just tell the anime ive watched so far maybe you guys can find one id like with what they have in commonnaruto amp shippuden hxh kingdom sao overlord seraphbleach saitama aot irumakun black clover todomachi game relife rezero demon slayer jujutsu kaisen slimedeath note classroom of the elite mushoku tensei bersekplatinum end tokyo revengers nhk souten no ken goblin slayer baki hajime no ippo mob dragonball noblesse makukucity actors arifuretajust so people dont suggest the following because they couldnt hook me up after a few episodes 28 mha fairy tail one piece tokyo ghoul vinland black jack redo of the healer log horizon spy x family boruto gintama shield hero fate dragon quest sailor moonthough i prefer long anime im fine with 12 episode length and i dislike episodic anime like gintama one piece and psychicharem and ecchi not preferred but as long as its not too focused on it unlike arifureta shield herobonus for psychological and mind games like log horizon death book classroom of the elite platinum end overlord and tosomaxhi gamebonus for weak mc that suffers and doesnt get better soonlike rezero and shield heroanime thats the best naruto  shippuden hxh bleach rezero death note berserk nhk aot early seasonsi hope the wallotext isnt too big i might have to format it if i dont get enough suggestions"
    },
    {
        "author": "Hercol",
        "created_utc": "Saturday, June 04, 2022 07:17:06",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ms7z/suggest_me_some_shows_to_watch/",
        "selftext": "I haven't watched too many anime shows but here is a short list of shows I absolutely loved watching:\n\n• BNA\n\n• One Punch Man\n\n• Highschool of the Dead\n\n• Erased\n\nI enjoy slice of realism mixed with supranational elements. Not to the point that there are explosions and fight scenes every three seconds though. I like main protagonist to be sort of an underdog who has to discover new world and defeat an enemy.",
        "subreddit": "anime",
        "title": "Suggest me some shows to watch",
        "created": "Saturday, June 04, 2022 11:17:06",
        "removed_by_category": null,
        "Preprocessed post": "i havent watched too many anime shows but here is a short list of shows i absolutely loved watching bna one punch man highschool of the dead erasedi enjoy slice of realism mixed with supranational elements not to the point that there are explosions and fight scenes every three seconds though i like main protagonist to be sort of an underdog who has to discover new world and defeat an enemy"
    },
    {
        "author": "rushncrush",
        "created_utc": "Saturday, June 04, 2022 07:16:42",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ms0w/2nd_season_of_kingdom_was_actually_amazing/",
        "selftext": "So glad I stuck with this show.  Very Bing worthy. So far the 1st half of season 1 was the worst part. 2nd half of season 1 was really good. Every episode of season 2 was amazing. Like top tier anime. The characters and story carry all the weight but it's so good that it makes it amazing even with the lacking animation. So many good story/character arcs. Multiple who have already died\n\nIf season 3 and 4 continues upwards this will easily be a GOAT anime.",
        "subreddit": "anime",
        "title": "2nd Season of Kingdom was actually amazing",
        "created": "Saturday, June 04, 2022 11:16:42",
        "removed_by_category": null,
        "Preprocessed post": "so glad i stuck with this show  very bing worthy so far the 1st half of season 1 was the worst part 2nd half of season 1 was really good every episode of season 2 was amazing like top tier anime the characters and story carry all the weight but its so good that it makes it amazing even with the lacking animation so many good storycharacter arcs multiple who have already diedif season 3 and 4 continues upwards this will easily be a goat anime"
    },
    {
        "author": "StaceDaGoat",
        "created_utc": "Saturday, June 04, 2022 07:16:03",
        "full_link": "https://www.reddit.com/r/anime/comments/v4mrpq/the_insane_potential_of_broly/",
        "selftext": "\nOk so we know that broly is a power house of a character with only having super saiyan and legendary super saiyan and goku and vegeta got all these other form and broly was stronger in just super saiyan 1 now IMAGINE if broly had god ki he would literally be unstoppable and I mean UNSTOPPABLE they would literally have to erase him or have the angles kill him and based off the new dbs trailer he is training on beerus’s planet with goku and vegeta so imagine how strong he would be after training with whis just IMAGINE let me know y’all thoughts on how strong you guys think broly would be after training with whis because I think if he was to obtain super saiyan god he would be angle level shit he might be stronger then most angles at that point but yea let me know y’all thoughts 🙃",
        "subreddit": "anime",
        "title": "THE INSANE POTENTIAL OF BROLY😈",
        "created": "Saturday, June 04, 2022 11:16:03",
        "removed_by_category": null,
        "Preprocessed post": "ok so we know that broly is a power house of a character with only having super saiyan and legendary super saiyan and goku and vegeta got all these other form and broly was stronger in just super saiyan 1 now imagine if broly had god ki he would literally be unstoppable and i mean unstoppable they would literally have to erase him or have the angles kill him and based off the new dbs trailer he is training on beeruss planet with goku and vegeta so imagine how strong he would be after training with whis just imagine let me know yall thoughts on how strong you guys think broly would be after training with whis because i think if he was to obtain super saiyan god he would be angle level shit he might be stronger then most angles at that point but yea let me know yall thoughts "
    },
    {
        "author": "Night-King_lWl_",
        "created_utc": "Saturday, June 04, 2022 06:41:18",
        "full_link": "https://www.reddit.com/r/anime/comments/v4maio/could_someone_please_help_me_find_the_anime/",
        "selftext": "I watched an anime that I forgot. All I remember is that the main character had some kind of board with him and used it in battles, and there was a big structure that had stairs around it and the main character and his friends had to go up the stairs and at different levels they had to fight. At the top of the structure the main character fought the villain. The villain’s name might be something similar to “world” I’m not sure tho.",
        "subreddit": "anime",
        "title": "Could someone please help me find the anime?",
        "created": "Saturday, June 04, 2022 10:41:18",
        "removed_by_category": null,
        "Preprocessed post": "i watched an anime that i forgot all i remember is that the main character had some kind of board with him and used it in battles and there was a big structure that had stairs around it and the main character and his friends had to go up the stairs and at different levels they had to fight at the top of the structure the main character fought the villain the villains name might be something similar to world im not sure tho"
    },
    {
        "author": "FreeSheffGWOO",
        "created_utc": "Saturday, June 04, 2022 06:18:42",
        "full_link": "https://www.reddit.com/r/anime/comments/v4lzg2/posted_my_current_top_15_animanga/",
        "selftext": "took a while to think about it but i made a t15 list and i did not miss.  https://twitter.com/FreeSheffGWoo/status/1533028254487126016?s=20&amp;t=nFHbx-6FC5UUFX\\_V-8jNeg",
        "subreddit": "anime",
        "title": "posted my current top 15 animanga",
        "created": "Saturday, June 04, 2022 10:18:42",
        "removed_by_category": null,
        "Preprocessed post": "took a while to think about it but i made a t15 list and i did not miss   isURL"
    },
    {
        "author": "Dante23102003",
        "created_utc": "Saturday, June 04, 2022 06:16:57",
        "full_link": "https://www.reddit.com/r/anime/comments/v4lym1/need_help_finding_an_old_anime/",
        "selftext": "The story is set on a different world( sort of). The main character is from the mountain area and they specialize in harnessing electricity using Modern wind mills. \n\nThe boy later gets hold of a small hotwheels like car which can turn into a giant Golden and Blue coloured dragon. The dragons weapon were two yellow sowrds if I remember correctly. There were also different clansclans like fire and water. \nI saw it during the 2012 to 2017 time frame. Also it aired on Cartoon network if I remember correctly.",
        "subreddit": "anime",
        "title": "Need help finding an old anime.",
        "created": "Saturday, June 04, 2022 10:16:57",
        "removed_by_category": null,
        "Preprocessed post": "the story is set on a different world sort of the main character is from the mountain area and they specialize in harnessing electricity using modern wind mills the boy later gets hold of a small hotwheels like car which can turn into a giant golden and blue coloured dragon the dragons weapon were two yellow sowrds if i remember correctly there were also different clansclans like fire and water i saw it during the 2012 to 2017 time frame also it aired on cartoon network if i remember correctly"
    },
    {
        "author": "AutoLovepon",
        "created_utc": "Saturday, June 04, 2022 06:05:50",
        "full_link": "https://www.reddit.com/r/anime/comments/v4lt9i/love_all_play_episode_10_discussion/",
        "selftext": "*Love All Play*, episode 10: 1+1\n\n\n\n# [Rate this episode here.](https://youpoll.me/79027/)\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n* [Crunchyroll](http://crunchyroll.com/love-all-play)\n* [Ani-One](https://www.youtube.com/playlist?list=PLxSscENEp7JhTcld54szOhI4UZJeSJrJc)\n* [VRV](https://vrv.co/series/GKEH2G4MW)\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/49556/)\n* [AniList](https://anilist.co/anime/137633)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&amp;aid=16527)\n* [Kitsu](https://kitsu.io/anime/44960)\n* [Anime-Planet](https://www.anime-planet.com/anime/love-all-play)\n* [Official Website](https://love-all-play.com/)\n\n---\n\n**All discussions**\n\nEpisode|Link|Score\n:-:|:-:|:-:\n1|[Link](https://redd.it/tufgnx)|[3.72](https://youpoll.me/74655/r)\n2|[Link](https://redd.it/tzq3ft)|[4.33](https://youpoll.me/75002/r)\n3|[Link](https://redd.it/u4unx0)|[4.86](https://youpoll.me/75346/r)\n4|[Link](https://redd.it/ua260p)|[4.33](https://youpoll.me/75709/r)\n5|[Link](https://redd.it/uf8dkx)|[4.22](https://youpoll.me/76239/r)\n6|[Link](https://redd.it/uka5rl)|[2.38](https://youpoll.me/76731/r)\n7|[Link](https://redd.it/upe47e)|[3.0](https://youpoll.me/77217/r)\n8|[Link](https://redd.it/uuk3g7)|[3.5](https://youpoll.me/77713/r)\n9|[Link](https://redd.it/uzka8p)|[5.0](https://youpoll.me/78358/r)\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "subreddit": "anime",
        "title": "Love All Play - Episode 10 discussion",
        "created": "Saturday, June 04, 2022 10:05:50",
        "removed_by_category": null,
        "Preprocessed post": "love all play episode 10 11 rate this episode here isURLreminder please do not discuss plot points not yet seen or skipped in the show failing to follow the rules may result in a banstreams crunchyroll isURL anione isURL vrv isURLshow information myanimelist isURL anilist isURL anidb isURL kitsu isURL animeplanet isURL official website isURLall discussionsepisodelinkscore1link isURL2link isURL3link isURL4link isURL5link isURL6link isURL7link isURL8link isURL9link isURLthis post was created by a bot message the mod team for feedback and commentsthe original source code can be found on github isURL"
    },
    {
        "author": "kirinzin",
        "created_utc": "Saturday, June 04, 2022 06:04:19",
        "full_link": "https://www.reddit.com/r/anime/comments/v4lske/what_do_i_watch_aesthetically/",
        "selftext": "can u guyz recommend me some aesthetic seinen/drama/shounen animes?",
        "subreddit": "anime",
        "title": "what do i watch aesthetically?",
        "created": "Saturday, June 04, 2022 10:04:19",
        "removed_by_category": null,
        "Preprocessed post": "can u guyz recommend me some aesthetic seinendramashounen animes"
    },
    {
        "author": "AnimeMod",
        "created_utc": "Saturday, June 04, 2022 06:00:12",
        "full_link": "https://www.reddit.com/r/anime/comments/v4lqeb/anime_questions_recommendations_and_discussion/",
        "selftext": "This is a daily megathread for general chatter about anime. Have questions or need recommendations? Here to show off your merch? Want to talk about what you just watched? [ ](https://i.imgur.com/fBtxJbJ.jpg)\n\n[This is the place!](https://preview.redd.it/npzrv76lje391.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=d45399af886ad17094cc85a822ad21b93215576f)\n\n[**All spoilers must be tagged.**](/r/anime/wiki/rules#wiki_tagging_comments) Use `[anime name]` to indicate the anime you're talking about before the spoiler tag, e.g. \\[Attack on Titan\\] &gt;!This is a popular anime.!&lt;\n\n[Prefer Discord? Check out our server: https://discord.gg/r-anime](https://discord.gg/r-anime)\n\n## Recommendations\n\nDon't know what to start next? [Check our wiki first!](/r/anime/wiki/recommendations)\n\nNot sure how to ask for a recommendation? Fill this out, or simply use it as a guideline, and other users will find it much easier to recommend you an anime!\n\n*I'm looking for:* A certain genre? Something specific like characters traveling to another world?\n\n*Shows I've already seen that are similar:* You can include a link to a list on another site if you have one, e.g. [MyAnimeList](https://myanimelist.net) or [AniList](https://anilist.co).\n\n## Resources\n\n* [Watch orders for many anime](/r/anime/wiki/watch_order)\n* [List of streaming sites](/r/anime/wiki/legal_streams) and [find where to watch a specific anime](https://www.livechart.me/search)\n* [Looking for the source of an image?](/r/anime/wiki/reverse_image_searching)\n* Currently airing anime: [AniChart.net](https://anichart.net/) | [LiveChart.me](https://www.livechart.me) | [MyAnimeList.net](https://myanimelist.net/anime/season)\n* [Frequently Asked Anime Questions](/r/anime/wiki/faaq)\n* [Related subreddits](/r/anime/wiki/related_subreddits)\n\n## Other Threads\n\n* [Cowboy Bebop](/comments/v2vgew) — Discussion for the selected anime of the week.\n* [Week in Review](/comments/uzzpqk) — Anime news and threads you might have missed.\n* [Casual Discussion](/comments/v3mifq) — Want to talk about something other than anime?\n* [Meta Thread](/comments/ufnepg) — Discussion about /r/anime's rules and moderation.\n\n^(This is a temporary trial thread, replacing the \"Merch Mondays\", \"Recommendation Tuesdays\", and \"Miscellaneous Anime Questions\" threads. Feedback is welcome in the Meta Thread.)",
        "subreddit": "anime",
        "title": "Anime Questions, Recommendations, and Discussion - June 04, 2022",
        "created": "Saturday, June 04, 2022 10:00:12",
        "removed_by_category": null,
        "Preprocessed post": "this is a daily megathread for general chatter about anime have questions or need recommendations here to show off your merch want to talk about what you just watched   isURLthis is the place isURLall spoilers must be taggedranimewikiruleswiki_tagging_comments use anime name to indicate the anime youre talking about before the spoiler tag eg attack on titan gtthis is a popular animeltprefer discord check out our server  isURL recommendationsdont know what to start next check our wiki firstranimewikirecommendationsnot sure how to ask for a recommendation fill this out or simply use it as a guideline and other users will find it much easier to recommend you an animeim looking for a certain genre something specific like characters traveling to another worldshows ive already seen that are similar you can include a link to a list on another site if you have one eg myanimelist isURL or anilist isURL resources watch orders for many animeranimewikiwatch_order list of streaming sitesranimewikilegal_streams and find where to watch a specific anime isURL looking for the source of an imageranimewikireverse_image_searching currently airing anime anichartnet isURL  livechartme isURL  myanimelistnet isURL frequently asked anime questionsranimewikifaaq related subredditsranimewikirelated_subreddits other threads cowboy bebopcommentsv2vgew  discussion for the selected anime of the week week in reviewcommentsuzzpqk  anime news and threads you might have missed casual discussioncommentsv3mifq  want to talk about something other than anime meta threadcommentsufnepg  discussion about ranimes rules and moderationthis is a temporary trial thread replacing the merch mondays recommendation tuesdays and miscellaneous anime questions threads feedback is welcome in the meta thread"
    },
    {
        "author": "Ratchet_Clank_29",
        "created_utc": "Saturday, June 04, 2022 05:38:30",
        "full_link": "https://www.reddit.com/r/anime/comments/v4lfxq/misa_amane_loses_her_memory_with_rem_edited_out/",
        "selftext": " Have you ever wondered how it would be Death Note just from L's point of view?  Let's watch \"Death Note L\" to find out! \n\nYesterday we saw episodes 12 to 16 and now they're freely downloadable as usual!\n\nI can't thank you enough for all the positive feedback!  \nFollow me for more info on this ongoing project:  \n\"@BionicLombax\" on Twitter or Instagram.\n\n*Processing video wea6keh5rk391...*",
        "subreddit": "anime",
        "title": "Misa Amane Loses Her Memory With Rem Edited Out To Be Invisible!",
        "created": "Saturday, June 04, 2022 09:38:30",
        "removed_by_category": null,
        "Preprocessed post": " have you ever wondered how it would be death note just from ls point of view  lets watch death note l to find out yesterday we saw episodes 12 to 16 and now theyre freely downloadable as usuali cant thank you enough for all the positive feedback  follow me for more info on this ongoing project  bioniclombax on twitter or instagramprocessing video wea6keh5rk391"
    },
    {
        "author": "Retifox",
        "created_utc": "Saturday, June 04, 2022 05:36:57",
        "full_link": "https://www.reddit.com/r/anime/comments/v4lf80/dragon_ball_naming_shenanigans/",
        "selftext": "Dragon Ball: Super \n\nDragon Ball: Heros\n\nSuper Dragon Ball Heroes\n\nDragon Ball Super: Super Hero\n\nSo I recently got into modern Dragon Ball and all. And I do hope whoever is charge of this series will learn that there's more then just Super and Hero word in dictionary",
        "subreddit": "anime",
        "title": "Dragon Ball: Naming Shenanigans",
        "created": "Saturday, June 04, 2022 09:36:57",
        "removed_by_category": null,
        "Preprocessed post": "dragon ball super dragon ball herossuper dragon ball heroesdragon ball super super heroso i recently got into modern dragon ball and all and i do hope whoever is charge of this series will learn that theres more then just super and hero word in dictionary"
    },
    {
        "author": "FireRifle64",
        "created_utc": "Saturday, June 04, 2022 05:05:20",
        "full_link": "https://www.reddit.com/r/anime/comments/v4l0mw/critiquing_older_animes_artstyleanimation/",
        "selftext": "Im curious to know what people think of critiquing animes that were made in say the 80's or 90's.  \nWhen you critique the art or animation of them, do you rate mainly as to when they came out or do you compare it to todays quality of anime/artstyle. Or do you try to keep in mind the times when it came out but still compare it to present anime?",
        "subreddit": "anime",
        "title": "Critiquing older animes artstyle/animation",
        "created": "Saturday, June 04, 2022 09:05:20",
        "removed_by_category": null,
        "Preprocessed post": "im curious to know what people think of critiquing animes that were made in say the 80s or 90s  when you critique the art or animation of them do you rate mainly as to when they came out or do you compare it to todays quality of animeartstyle or do you try to keep in mind the times when it came out but still compare it to present anime"
    },
    {
        "author": "BiggChurch",
        "created_utc": "Saturday, June 04, 2022 05:04:48",
        "full_link": "https://www.reddit.com/r/anime/comments/v4l0dt/i_need_anime_to_watch/",
        "selftext": "So I absolutely love anime but I haven't watched in years... I like slice of life, comedy, romance, shojo basically anything. I am open to any suggestions I just want to have fun with anime again!",
        "subreddit": "anime",
        "title": "I need anime to watch!!",
        "created": "Saturday, June 04, 2022 09:04:48",
        "removed_by_category": null,
        "Preprocessed post": "so i absolutely love anime but i havent watched in years i like slice of life comedy romance shojo basically anything i am open to any suggestions i just want to have fun with anime again"
    },
    {
        "author": "Spacecowboy947",
        "created_utc": "Saturday, June 04, 2022 05:03:24",
        "full_link": "https://www.reddit.com/r/anime/comments/v4kzrg/i_watched_the_entirety_of_oregairu_in_a_single/",
        "selftext": "I'm not sure the point of this post tbh I'm just so sad it's over, by episode 1 I was hooked, by the time the credits rolled at the end of season 3 I was in a complete state. A truly fantastic anime. \n\nAny recommendations for a good rom-com? So I can repeat this process again lol",
        "subreddit": "anime",
        "title": "I watched the entirety of oregairu in a single day and now I'm filled with crushing emptiness",
        "created": "Saturday, June 04, 2022 09:03:24",
        "removed_by_category": null,
        "Preprocessed post": "im not sure the point of this post tbh im just so sad its over by episode 1 i was hooked by the time the credits rolled at the end of season 3 i was in a complete state a truly fantastic anime any recommendations for a good romcom so i can repeat this process again lol"
    },
    {
        "author": "krazy_kitty5000",
        "created_utc": "Saturday, June 04, 2022 04:32:22",
        "full_link": "https://www.reddit.com/r/anime/comments/v4klb2/what_streaming_service_does_everyone_use_to_watch/",
        "selftext": "I keep seeing people talking about certain animes I want to watch but can't find a way to watch them I've tried funimation and cruncyroll but can't find them any ideas what others I could try?",
        "subreddit": "anime",
        "title": "what streaming service does everyone use to watch anime?",
        "created": "Saturday, June 04, 2022 08:32:22",
        "removed_by_category": null,
        "Preprocessed post": "i keep seeing people talking about certain animes i want to watch but cant find a way to watch them ive tried funimation and cruncyroll but cant find them any ideas what others i could try"
    },
    {
        "author": "Dry_Sir_9621",
        "created_utc": "Saturday, June 04, 2022 04:31:31",
        "full_link": "https://www.reddit.com/r/anime/comments/v4kkwr/amagami_ss_anime_or_manga/",
        "selftext": "Which one should I follow? Did anime cover everything? Means, is it completed? Or should I directly start with manga?",
        "subreddit": "anime",
        "title": "Amagami SS - anime or manga?",
        "created": "Saturday, June 04, 2022 08:31:31",
        "removed_by_category": null,
        "Preprocessed post": "which one should i follow did anime cover everything means is it completed or should i directly start with manga"
    },
    {
        "author": "RUyk1910",
        "created_utc": "Saturday, June 04, 2022 04:28:36",
        "full_link": "https://www.reddit.com/r/anime/comments/v4kjiq/join_my_discord_hoo/",
        "selftext": "Heyo people Join my discord for a fun and nice community. there are bots and many other things to play with and active people to talk and music bots too!!! and not to forget some anime bots so that u can build your own harem inv down below join and inv your friends too!!!!\n\n&amp;#x200B;\n\ninv: [https://discord.gg/fuqkpEdAE6](https://discord.gg/fuqkpEdAE6)",
        "subreddit": "anime",
        "title": "Join My discord #HOO",
        "created": "Saturday, June 04, 2022 08:28:36",
        "removed_by_category": null,
        "Preprocessed post": "heyo people join my discord for a fun and nice community there are bots and many other things to play with and active people to talk and music bots too and not to forget some anime bots so that u can build your own harem inv down below join and inv your friends tooampx200binv  isURL"
    },
    {
        "author": "AllahinSopasiYoktur",
        "created_utc": "Saturday, June 04, 2022 03:53:39",
        "full_link": "https://www.reddit.com/r/anime/comments/v4k31p/attack_on_titan_is_a_mecha_anime/",
        "selftext": "yeah i just wanted to say that that's it.",
        "subreddit": "anime",
        "title": "attack on titan is a mecha anime",
        "created": "Saturday, June 04, 2022 07:53:39",
        "removed_by_category": null,
        "Preprocessed post": "yeah i just wanted to say that thats it"
    },
    {
        "author": "Quirky-Ad6916",
        "created_utc": "Saturday, June 04, 2022 03:51:31",
        "full_link": "https://www.reddit.com/r/anime/comments/v4k24p/can_harley_quinn_befriend_elsa_granhirte/",
        "selftext": "Somehow Elsa(RE:ZERO) has been informed to kill Harley(suicide squad movie), and harley finds out about it too. Harley gives up fighting against an enemy superior to her and goes to Elsa directly to make friends with her. With only a weapon for self-defense, she hides her hand behind her back and slowly approaches her and tries to talk. She jokes with Elsa, sticking her stomach out with her hands behind her back, and reveals that she has no intention of attacking her. How will Elsa react to this?",
        "subreddit": "anime",
        "title": "Can Harley Quinn befriend Elsa Granhirte?",
        "created": "Saturday, June 04, 2022 07:51:31",
        "removed_by_category": null,
        "Preprocessed post": "somehow elsarezero has been informed to kill harleysuicide squad movie and harley finds out about it too harley gives up fighting against an enemy superior to her and goes to elsa directly to make friends with her with only a weapon for selfdefense she hides her hand behind her back and slowly approaches her and tries to talk she jokes with elsa sticking her stomach out with her hands behind her back and reveals that she has no intention of attacking her how will elsa react to this"
    },
    {
        "author": "seriousart1st",
        "created_utc": "Saturday, June 04, 2022 03:51:19",
        "full_link": "https://www.reddit.com/r/anime/comments/v4k21h/looking_for_artists_for_a_project_bloom_a_new/",
        "selftext": "Me and my crew are seeking voluntary artists with experience in Writing and Illustration to develop a story called Bloom/Saku.\n\n**BASIC STORY:**\n\nIt is a story set about 2000 years from now. It is about a young man, named Jion, who lives in a world where technology is striving to replace organic life with machines. Humans have been divided into different clans, who only share one thing in common which is a cult-like worship of a flower that was produced by mother nature in order to fight the machines. The flower increases their core sense allowing them to rebel against the machines. When Jion was 14 years old one of the clans attacked his village and killed his sister. This clan has taken partial control of machines and used technology against all their defenses. His family is killed and after his sister is killed in front of him he starts going insane throughout the story. He has a special connection to the miracle flower. The clan who raided his town had heard a rumor of someone who had this connection and lived in his village, which is why they raided it. He joins the military and is selected to be injected with the serum produced from the miracle flower. It is not long after this that he starts noticing the powers that hide behind his bloodline. \n\n**\\*POSITIONS:\\***\n\n&amp;#x200B;\n\n\\- Character designer\n\n&amp;#x200B;\n\n\\- Page Illustrator\n\n&amp;#x200B;\n\n\\- Writer's assistant / Storyboard artist\n\n&amp;#x200B;\n\n\\- Environment Artist  \n\n\n**\\*\\*REQUIREMENTS:\\*\\***\n\n\\- Must be 16+\n\n\\- Must have experience in the desired position\n\n\\- Must be willing to work and participate with crew members.\n\nApplications will be filed here: [https://docs.google.com/forms/d/e/1FAIpQLSer\\_fCSuldFWuxIM\\_wbyraX2R1DsrdK3Uyy8MWRjrij5WlX5Q/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSer_fCSuldFWuxIM_wbyraX2R1DsrdK3Uyy8MWRjrij5WlX5Q/viewform?usp=sf_link)  \n\n\nThank you for your interest. We hope to see you build this project and community with us!",
        "subreddit": "anime",
        "title": "LOOKING FOR ARTISTS FOR A PROJECT! Bloom - A New Manga being developed.",
        "created": "Saturday, June 04, 2022 07:51:19",
        "removed_by_category": null,
        "Preprocessed post": "me and my crew are seeking voluntary artists with experience in writing and illustration to develop a story called bloomsakubasic storyit is a story set about 2000 years from now it is about a young man named jion who lives in a world where technology is striving to replace organic life with machines humans have been divided into different clans who only share one thing in common which is a cultlike worship of a flower that was produced by mother nature in order to fight the machines the flower increases their core sense allowing them to rebel against the machines when jion was 14 years old one of the clans attacked his village and killed his sister this clan has taken partial control of machines and used technology against all their defenses his family is killed and after his sister is killed in front of him he starts going insane throughout the story he has a special connection to the miracle flower the clan who raided his town had heard a rumor of someone who had this connection and lived in his village which is why they raided it he joins the military and is selected to be injected with the serum produced from the miracle flower it is not long after this that he starts noticing the powers that hide behind his bloodline positionsampx200b character designerampx200b page illustratorampx200b writers assistant  storyboard artistampx200b environment artist  requirements must be 16 must have experience in the desired position must be willing to work and participate with crew membersapplications will be filed here  isURL  thank you for your interest we hope to see you build this project and community with us"
    },
    {
        "author": "Dark-Oracle",
        "created_utc": "Saturday, June 04, 2022 03:49:11",
        "full_link": "https://www.reddit.com/r/anime/comments/v4k0z7/short_anime_that_has_fight_scenes_similar_to_one/",
        "selftext": "Short anime means 24 episodes or around 30\n\nOther anime i can think of are jujutsu kaisen &amp; Demon slayer\n\nMaybe even Fire force counts... Not that short but i liked it enough to make it Through\n\nBig animes are hard for me to complete if i dont find them engaging.. So, not those for now",
        "subreddit": "anime",
        "title": "Short anime that has fight scenes similar to One punch man, Mob psycho, MHA &amp; HxH??",
        "created": "Saturday, June 04, 2022 07:49:11",
        "removed_by_category": null,
        "Preprocessed post": "short anime means 24 episodes or around 30other anime i can think of are jujutsu kaisen amp demon slayermaybe even fire force counts not that short but i liked it enough to make it throughbig animes are hard for me to complete if i dont find them engaging so not those for now"
    },
    {
        "author": "GlassKnown3068",
        "created_utc": "Saturday, June 04, 2022 03:29:23",
        "full_link": "https://www.reddit.com/r/anime/comments/v4jrlp/i_need_a_anime_reccomandation/",
        "selftext": "I have watched hundreds of anime and I am tired of the pretty boy mc who is strong. What I am looking for is a badass mc who looks older and more rugged with scars all over his face. It doesn’t have to be exactly like that but something similar.",
        "subreddit": "anime",
        "title": "I need a anime reccomandation",
        "created": "Saturday, June 04, 2022 07:29:23",
        "removed_by_category": null,
        "Preprocessed post": "i have watched hundreds of anime and i am tired of the pretty boy mc who is strong what i am looking for is a badass mc who looks older and more rugged with scars all over his face it doesnt have to be exactly like that but something similar"
    },
    {
        "author": "Friendly-Crab8048",
        "created_utc": "Saturday, June 04, 2022 03:28:33",
        "full_link": "https://www.reddit.com/r/anime/comments/v4jr70/william_james_moriarty_vs_light_yagami_a/",
        "selftext": "I was scrolling through Netflix and chanced upon Moriarty the Patriot and after reading the synopsis I decided to watch the anime and I was not disappointed. The mystery, the character development and drama was all well done and I enjoyed it. Shortly after I watched death note, again intrigued by the concept. After watching I couldn't help but notice a similarity between the MCs. \n\nBoth were on a mission to create a \"new world\". Both were out on a noble cause. William wanted to expose the vices of the nobility and take down the rich. Light wanted to do the same but he was just targeting criminals instead of rich people. This could be due to the different time periods both anime take place in. Nevertheless both MCs used crime and death to eradicate a certain group of people to purify the world. They also used different aliases to hide their true identities: William being known as 'Lord of Crime' ~~although it was more than one person~~  and Light being 'Kira'. Both were also highly intelligent. The smart plans and plot twists was what I liked about both shows.\n\nI would also like  to point out the similarities between the relationships between the MCs and their antagonists. Sherlock was wound up investigating the crimes orchestrated by William and William had him dancing at the tip of his palm (\"*Catch me if you can Mr Sherlock Holmes\")*. What I really liked between them was that they could anticipate each other moves...there was some telepathic connection between the 2 of them. The bromance was made the ending so emotional and satisfying. Whereas, between Light and L, there was mind games going on between them. L would anticipate Kira's moves and  Kira would plan his moves according to what L might do. It was a battle of wits. At one point in time, L even confesses to Light that he was his first true friend. I also really liked the scene  when L offered to wash Light's feet during his final moments. There was some divine symbolism and showed their relationship. However, there was no bad blood between William and Sherlock but Light remained focused on his goal to eliminate L till the end. \n\nThe biggest difference lies in how the two were portrayed. William was presented as a villain to the public but a hero to the audience. He had the support of his brothers and friends to carry out the crimes and achieve their goals. His cause was presented as noble, especially given his childhood, so the crimes that he committed, no matter how heinous, were justified. Whereas Light's objectives were seen as childish and malicious. Although he was wary of using the death note when he first got it, after killing a criminal to test out the note, he formed his mission to transform the world. In my opinion, the turning point was when Light managed to pull off killing Raye Penber, *making* Penber kill all the FBI agents as well as *making* Naomi kill herself. This entire act made him more confident in using the death note and as a result his hunger for power grew. That was when he strayed away from his goal and jut mercilessly killed anyone for his own benefit, on the whole waging a war with L. Some might argue that Light did change the world as the crime rates decreased and wars were avoided, saving more lives than killed (according to sources I've read). But this is not really made clear In the show and Light was still portrayed as a villain till his last breath. The important thing here is that William did not stray away from his targets and left innocent people unharmed. \n\nThe interesting thing here is also that the Lord of Crime did not have any supporters and was constantly being chased by the police and feared by the public. Even though he was the one who solved the country's inequality issue. Whereas Kira had a large fan following and basically created a cult. Considering the time period where both animes were set in, it shows the impact social media and the internet has in propagating such activities. The radio was a key player in the Kira case (eg. broadcasting the exchanges between both Kira's, luring Higuchi to the studio). In fact, if criminals' names and faces were not broadcasted to the public, Kira would have no one to kill.  I wonder if William had the death note, would have done things differently?  Or would he not pick it up at all?\n\n&amp;#x200B;\n\nSorry for the long post but these were some observations I made watching both shows b2b and I had to put them into words. Both shows  were certainly engaging and had me at the edge of my seat. Would love to hear all of your thoughts :D",
        "subreddit": "anime",
        "title": "William James Moriarty vs Light Yagami: a comparison",
        "created": "Saturday, June 04, 2022 07:28:33",
        "removed_by_category": null,
        "Preprocessed post": "i was scrolling through netflix and chanced upon moriarty the patriot and after reading the synopsis i decided to watch the anime and i was not disappointed the mystery the character development and drama was all well done and i enjoyed it shortly after i watched death note again intrigued by the concept after watching i couldnt help but notice a similarity between the mcs both were on a mission to create a new world both were out on a noble cause william wanted to expose the vices of the nobility and take down the rich light wanted to do the same but he was just targeting criminals instead of rich people this could be due to the different time periods both anime take place in nevertheless both mcs used crime and death to eradicate a certain group of people to purify the world they also used different aliases to hide their true identities william being known as lord of crime although it was more than one person  and light being kira both were also highly intelligent the smart plans and plot twists was what i liked about both showsi would also like  to point out the similarities between the relationships between the mcs and their antagonists sherlock was wound up investigating the crimes orchestrated by william and william had him dancing at the tip of his palm catch me if you can mr sherlock holmes what i really liked between them was that they could anticipate each other movesthere was some telepathic connection between the 2 of them the bromance was made the ending so emotional and satisfying whereas between light and l there was mind games going on between them l would anticipate kiras moves and  kira would plan his moves according to what l might do it was a battle of wits at one point in time l even confesses to light that he was his first true friend i also really liked the scene  when l offered to wash lights feet during his final moments there was some divine symbolism and showed their relationship however there was no bad blood between william and sherlock but light remained focused on his goal to eliminate l till the end the biggest difference lies in how the two were portrayed william was presented as a villain to the public but a hero to the audience he had the support of his brothers and friends to carry out the crimes and achieve their goals his cause was presented as noble especially given his childhood so the crimes that he committed no matter how heinous were justified whereas lights objectives were seen as childish and malicious although he was wary of using the death note when he first got it after killing a criminal to test out the note he formed his mission to transform the world in my opinion the turning point was when light managed to pull off killing raye penber making penber kill all the fbi agents as well as making naomi kill herself this entire act made him more confident in using the death note and as a result his hunger for power grew that was when he strayed away from his goal and jut mercilessly killed anyone for his own benefit on the whole waging a war with l some might argue that light did change the world as the crime rates decreased and wars were avoided saving more lives than killed according to sources ive read but this is not really made clear in the show and light was still portrayed as a villain till his last breath the important thing here is that william did not stray away from his targets and left innocent people unharmed the interesting thing here is also that the lord of crime did not have any supporters and was constantly being chased by the police and feared by the public even though he was the one who solved the countrys inequality issue whereas kira had a large fan following and basically created a cult considering the time period where both animes were set in it shows the impact social media and the internet has in propagating such activities the radio was a key player in the kira case eg broadcasting the exchanges between both kiras luring higuchi to the studio in fact if criminals names and faces were not broadcasted to the public kira would have no one to kill  i wonder if william had the death note would have done things differently  or would he not pick it up at allampx200bsorry for the long post but these were some observations i made watching both shows b2b and i had to put them into words both shows  were certainly engaging and had me at the edge of my seat would love to hear all of your thoughts d"
    },
    {
        "author": "Nikorasu-in-Japan",
        "created_utc": "Saturday, June 04, 2022 03:26:34",
        "full_link": "https://www.reddit.com/r/anime/comments/v4jq8s/can_you_guess_the_anime/",
        "selftext": "I went to that place last month. The weather was really nice !",
        "subreddit": "anime",
        "title": "Can you guess the anime ?",
        "created": "Saturday, June 04, 2022 07:26:34",
        "removed_by_category": null,
        "Preprocessed post": "i went to that place last month the weather was really nice "
    },
    {
        "author": "Nikorasu-in-Japan",
        "created_utc": "Saturday, June 04, 2022 03:22:48",
        "full_link": "https://www.reddit.com/r/anime/comments/v4joe8/can_you_guess_the_anime/",
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/hf319ox13k391.jpg?width=320&amp;format=pjpg&amp;auto=webp&amp;s=f564d469bcd723688769c324adec0028b7d953ab",
        "subreddit": "anime",
        "title": "Can you guess the anime ?",
        "created": "Saturday, June 04, 2022 07:22:48",
        "removed_by_category": null,
        "Preprocessed post": "ampx200b isURL"
    },
    {
        "author": "Nikorasu-in-Japan",
        "created_utc": "Saturday, June 04, 2022 03:06:42",
        "full_link": "https://www.reddit.com/r/anime/comments/v4jg90/can_you_guess_the_anime/",
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/g0h2p0o50k391.jpg?width=320&amp;format=pjpg&amp;auto=webp&amp;s=62741975db6ae235ce8c9bfb005f0602d97f7353",
        "subreddit": "anime",
        "title": "Can you guess the anime ?",
        "created": "Saturday, June 04, 2022 07:06:42",
        "removed_by_category": null,
        "Preprocessed post": "ampx200b isURL"
    },
    {
        "author": "Karottenregen",
        "created_utc": "Saturday, June 04, 2022 03:00:33",
        "full_link": "https://www.reddit.com/r/anime/comments/v4jd0d/im_looking_for_an_anime/",
        "selftext": "So i may be looking for an anime i think i saw about 7 years ago on tv or at least 1 episode of it idk why i just randomly remembered a scene from it so idk anything about the plot i just remember it has to do something with vampires and there mabye was a scene where a boy with white hair gets biten by some vampire dude but tbh i dont have much hope finding it since im not even shure if that anime really exists",
        "subreddit": "anime",
        "title": "im looking for an anime",
        "created": "Saturday, June 04, 2022 07:00:33",
        "removed_by_category": null,
        "Preprocessed post": "so i may be looking for an anime i think i saw about 7 years ago on tv or at least 1 episode of it idk why i just randomly remembered a scene from it so idk anything about the plot i just remember it has to do something with vampires and there mabye was a scene where a boy with white hair gets biten by some vampire dude but tbh i dont have much hope finding it since im not even shure if that anime really exists"
    },
    {
        "author": "RedditSavior2",
        "created_utc": "Saturday, June 04, 2022 02:30:28",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ixrj/im_very_confused_when_it_comes_to_baki_and_need/",
        "selftext": "So I’m trying to watch baki on Netflix. Does it have all the episodes? \nAlso there is “baki” and “baki hanma” which do I watch first?",
        "subreddit": "anime",
        "title": "I’m very confused when it comes to baki and need help.",
        "created": "Saturday, June 04, 2022 06:30:28",
        "removed_by_category": null,
        "Preprocessed post": "so im trying to watch baki on netflix does it have all the episodes also there is baki and baki hanma which do i watch first"
    },
    {
        "author": "WhatAGuy59",
        "created_utc": "Saturday, June 04, 2022 02:20:41",
        "full_link": "https://www.reddit.com/r/anime/comments/v4isz3/looking_for_name_of_an_emotional_bl_anime_with/",
        "selftext": " For some specifics, they were two ancient samurai lovers and one had to kill himself to protect his country. Then the living samurai starts making dolls for him to talk to, and the first doll he makes says something the dead samurai would say.  Any help is appreciated.",
        "subreddit": "anime",
        "title": "Looking for name of an emotional BL anime with two ancient samurai lovers where one of them kills himself to protect his country and the living one creates dolls to talk to",
        "created": "Saturday, June 04, 2022 06:20:41",
        "removed_by_category": null,
        "Preprocessed post": " for some specifics they were two ancient samurai lovers and one had to kill himself to protect his country then the living samurai starts making dolls for him to talk to and the first doll he makes says something the dead samurai would say  any help is appreciated"
    },
    {
        "author": "ziomek1234567890",
        "created_utc": "Saturday, June 04, 2022 02:04:11",
        "full_link": "https://www.reddit.com/r/anime/comments/v4ikgz/twin_stars_kenji_miyazawa/",
        "selftext": "is it true that the story of twin stars miyazawa kenji has 2 parts, and the anime series (kenji no trunk) adapts only one part?",
        "subreddit": "anime",
        "title": "Twin stars Kenji miyazawa",
        "created": "Saturday, June 04, 2022 06:04:11",
        "removed_by_category": null,
        "Preprocessed post": "is it true that the story of twin stars miyazawa kenji has 2 parts and the anime series kenji no trunk adapts only one part"
    },
    {
        "author": "DotGlobal8483",
        "created_utc": "Saturday, June 04, 2022 01:29:21",
        "full_link": "https://www.reddit.com/r/anime/comments/v4i204/what_i_dont_understand_about_angel_of_death/",
        "selftext": " Like some people question\"WeLl RaChEl SaYs ShE wAnTs To DiE bUt DoEs ThE OpPoSiTe\", you litterally saw her say she wants zack to keep their promise yeah its dumb but shes like 12 and so probably isnt thinking smart enough to think that\"yknow fuck this guy just kill me\". The anime start is rough but think about what it leaves out in the open at the start. rewatch and you see that the anime is litterally screaming foreshadowing so early i love it. Some people say that the characters dont have development. Of course you aint gonna notice it that much characters just dont change overnight it slowly happens over time. Another one i found is that there is no main villain, like A: you dont need an anime with a big villain and B: the anime doesnt really have one. You can somewhat understand most of the characters(except the creepy doctor hes just fuckin weird, but its shown decently well enough). Like am i just dumb or is just weird.",
        "subreddit": "anime",
        "title": "What i dont understand about angel of death complaints.",
        "created": "Saturday, June 04, 2022 05:29:21",
        "removed_by_category": null,
        "Preprocessed post": " like some people questionwell rachel says she wants to die but does the opposite you litterally saw her say she wants zack to keep their promise yeah its dumb but shes like 12 and so probably isnt thinking smart enough to think thatyknow fuck this guy just kill me the anime start is rough but think about what it leaves out in the open at the start rewatch and you see that the anime is litterally screaming foreshadowing so early i love it some people say that the characters dont have development of course you aint gonna notice it that much characters just dont change overnight it slowly happens over time another one i found is that there is no main villain like a you dont need an anime with a big villain and b the anime doesnt really have one you can somewhat understand most of the charactersexcept the creepy doctor hes just fuckin weird but its shown decently well enough like am i just dumb or is just weird"
    },
    {
        "author": "Appropriate_Care_769",
        "created_utc": "Saturday, June 04, 2022 01:22:42",
        "full_link": "https://www.reddit.com/r/anime/comments/v4hyfu/help_me_remember_what_this_anime_is_called_please/",
        "selftext": "While rewatching Erased I felt like something was missing like I remember some parts that weren’t there on the rewatch but I think I might be confusing it with another anime. I remember an anime where the MC likes a girl and I believe the girl might die or something and I remember he befriends her little brother and says something that inspires the little brother to be a detective/officer in the future and he helps the MC figure out the mistery. The brother knows of the MC’s abilities and I feel like when he uses it he leaves his body behind.. ring any bells?",
        "subreddit": "anime",
        "title": "Help me remember what this anime is called please!",
        "created": "Saturday, June 04, 2022 05:22:42",
        "removed_by_category": null,
        "Preprocessed post": "while rewatching erased i felt like something was missing like i remember some parts that werent there on the rewatch but i think i might be confusing it with another anime i remember an anime where the mc likes a girl and i believe the girl might die or something and i remember he befriends her little brother and says something that inspires the little brother to be a detectiveofficer in the future and he helps the mc figure out the mistery the brother knows of the mcs abilities and i feel like when he uses it he leaves his body behind ring any bells"
    },
    {
        "author": "potatosarewatching",
        "created_utc": "Saturday, June 04, 2022 01:16:18",
        "full_link": "https://www.reddit.com/r/anime/comments/v4hv0a/the_irregular_at_magic_highschool_is_propaganda/",
        "selftext": "The first arc especially, is all about the oppressed system voicing their complaints about being oppressed being squashed by a \"high achieving\" person from their own \"class\" They tout \"how dare the pissants not know their betters work hard\" as an anime trope. Sure they try to write it off as a peer levying these opinions, but it is clear that this anime is trying to put those \"under the status quo\" in their place.",
        "subreddit": "anime",
        "title": "The Irregular at Magic Highschool is propaganda!",
        "created": "Saturday, June 04, 2022 05:16:18",
        "removed_by_category": null,
        "Preprocessed post": "the first arc especially is all about the oppressed system voicing their complaints about being oppressed being squashed by a high achieving person from their own class they tout how dare the pissants not know their betters work hard as an anime trope sure they try to write it off as a peer levying these opinions but it is clear that this anime is trying to put those under the status quo in their place"
    }
]